1: kd> dt nt!_KTHREAD -r
   +0x000 Header           : _DISPATCHER_HEADER
      +0x000 Lock             : Int4B
      +0x000 LockNV           : Int4B
      +0x000 Type             : UChar
      +0x001 Signalling       : UChar
      +0x002 Size             : UChar
      +0x003 Reserved1        : UChar
      +0x000 TimerType        : UChar
      +0x001 TimerControlFlags : UChar
      +0x001 Absolute         : Pos 0, 1 Bit
      +0x001 Wake             : Pos 1, 1 Bit
      +0x001 EncodedTolerableDelay : Pos 2, 6 Bits
      +0x002 Hand             : UChar
      +0x003 TimerMiscFlags   : UChar
      +0x003 Index            : Pos 0, 6 Bits
      +0x003 Inserted         : Pos 6, 1 Bit
      +0x003 Expired          : Pos 7, 1 Bit
      +0x000 Timer2Type       : UChar
      +0x001 Timer2Flags      : UChar
      +0x001 Timer2Inserted   : Pos 0, 1 Bit
      +0x001 Timer2Expiring   : Pos 1, 1 Bit
      +0x001 Timer2CancelPending : Pos 2, 1 Bit
      +0x001 Timer2SetPending : Pos 3, 1 Bit
      +0x001 Timer2Running    : Pos 4, 1 Bit
      +0x001 Timer2Disabled   : Pos 5, 1 Bit
      +0x001 Timer2ReservedFlags : Pos 6, 2 Bits
      +0x002 Timer2ComponentId : UChar
      +0x003 Timer2RelativeId : UChar
      +0x000 QueueType        : UChar
      +0x001 QueueControlFlags : UChar
      +0x001 Abandoned        : Pos 0, 1 Bit
      +0x001 DisableIncrement : Pos 1, 1 Bit
      +0x001 QueueReservedControlFlags : Pos 2, 6 Bits
      +0x002 QueueSize        : UChar
      +0x003 QueueReserved    : UChar
      +0x000 ThreadType       : UChar
      +0x001 ThreadReserved   : UChar
      +0x002 ThreadControlFlags : UChar
      +0x002 CycleProfiling   : Pos 0, 1 Bit
      +0x002 CounterProfiling : Pos 1, 1 Bit
      +0x002 GroupScheduling  : Pos 2, 1 Bit
      +0x002 AffinitySet      : Pos 3, 1 Bit
      +0x002 Tagged           : Pos 4, 1 Bit
      +0x002 EnergyProfiling  : Pos 5, 1 Bit
      +0x002 SchedulerAssist  : Pos 6, 1 Bit
      +0x002 ThreadReservedControlFlags : Pos 7, 1 Bit
      +0x003 DebugActive      : UChar
      +0x003 ActiveDR7        : Pos 0, 1 Bit
      +0x003 Instrumented     : Pos 1, 1 Bit
      +0x003 Minimal          : Pos 2, 1 Bit
      +0x003 Reserved4        : Pos 3, 2 Bits
      +0x003 AltSyscall       : Pos 5, 1 Bit
      +0x003 UmsScheduled     : Pos 6, 1 Bit
      +0x003 UmsPrimary       : Pos 7, 1 Bit
      +0x000 MutantType       : UChar
      +0x001 MutantSize       : UChar
      +0x002 DpcActive        : UChar
      +0x003 MutantReserved   : UChar
      +0x004 SignalState      : Int4B
      +0x008 WaitListHead     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x018 SListFaultAddress : Ptr64 Void
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr64 Void
   +0x030 StackLimit       : Ptr64 Void
   +0x038 StackBase        : Ptr64 Void
   +0x040 ThreadLock       : Uint8B
   +0x048 CycleTime        : Uint8B
   +0x050 CurrentRunTime   : Uint4B
   +0x054 ExpectedRunTime  : Uint4B
   +0x058 KernelStack      : Ptr64 Void
   +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
      +0x000 ControlWord      : Uint2B
      +0x002 StatusWord       : Uint2B
      +0x004 TagWord          : UChar
      +0x005 Reserved1        : UChar
      +0x006 ErrorOpcode      : Uint2B
      +0x008 ErrorOffset      : Uint4B
      +0x00c ErrorSelector    : Uint2B
      +0x00e Reserved2        : Uint2B
      +0x010 DataOffset       : Uint4B
      +0x014 DataSelector     : Uint2B
      +0x016 Reserved3        : Uint2B
      +0x018 MxCsr            : Uint4B
      +0x01c MxCsr_Mask       : Uint4B
      +0x020 FloatRegisters   : [8] _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x0a0 XmmRegisters     : [16] _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x1a0 Reserved4        : [96] UChar
   +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
      +0x000 Policy           : _KSCHEDULING_GROUP_POLICY
         +0x000 Value            : Uint4B
         +0x000 Weight           : Uint2B
         +0x000 MinRate          : Uint2B
         +0x002 MaxRate          : Uint2B
         +0x004 AllFlags         : Uint4B
         +0x004 Type             : Pos 0, 1 Bit
         +0x004 Disabled         : Pos 1, 1 Bit
         +0x004 RankBias         : Pos 2, 1 Bit
         +0x004 Spare1           : Pos 3, 29 Bits
      +0x008 RelativeWeight   : Uint4B
      +0x00c ChildMinRate     : Uint4B
      +0x010 ChildMinWeight   : Uint4B
      +0x014 ChildTotalWeight : Uint4B
      +0x018 QueryHistoryTimeStamp : Uint8B
      +0x020 NotificationCycles : Int8B
      +0x028 MaxQuotaLimitCycles : Int8B
      +0x030 MaxQuotaCyclesRemaining : Int8B
      +0x038 SchedulingGroupList : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x038 Sibling          : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x048 NotificationDpc  : Ptr64 _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x050 ChildList        : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x060 Parent           : Ptr64 _KSCHEDULING_GROUP
         +0x000 Policy           : _KSCHEDULING_GROUP_POLICY
         +0x008 RelativeWeight   : Uint4B
         +0x00c ChildMinRate     : Uint4B
         +0x010 ChildMinWeight   : Uint4B
         +0x014 ChildTotalWeight : Uint4B
         +0x018 QueryHistoryTimeStamp : Uint8B
         +0x020 NotificationCycles : Int8B
         +0x028 MaxQuotaLimitCycles : Int8B
         +0x030 MaxQuotaCyclesRemaining : Int8B
         +0x038 SchedulingGroupList : _LIST_ENTRY
         +0x038 Sibling          : _LIST_ENTRY
         +0x048 NotificationDpc  : Ptr64 _KDPC
         +0x050 ChildList        : _LIST_ENTRY
         +0x060 Parent           : Ptr64 _KSCHEDULING_GROUP
         +0x080 PerProcessor     : [1] _KSCB
      +0x080 PerProcessor     : [1] _KSCB
         +0x000 GenerationCycles : Uint8B
         +0x008 MinQuotaCycleTarget : Uint8B
         +0x010 MaxQuotaCycleTarget : Uint8B
         +0x018 RankCycleTarget  : Uint8B
         +0x020 LongTermCycles   : Uint8B
         +0x028 LastReportedCycles : Uint8B
         +0x030 OverQuotaHistory : Uint8B
         +0x038 ReadyTime        : Uint8B
         +0x040 InsertTime       : Uint8B
         +0x048 PerProcessorList : _LIST_ENTRY
         +0x058 QueueNode        : _RTL_BALANCED_NODE
         +0x070 Inserted         : Pos 0, 1 Bit
         +0x070 MaxOverQuota     : Pos 1, 1 Bit
         +0x070 MinOverQuota     : Pos 2, 1 Bit
         +0x070 RankBias         : Pos 3, 1 Bit
         +0x070 SoftCap          : Pos 4, 1 Bit
         +0x070 ShareRankOwner   : Pos 5, 1 Bit
         +0x070 Spare1           : Pos 6, 2 Bits
         +0x071 Depth            : UChar
         +0x072 ReadySummary     : Uint2B
         +0x074 Rank             : Uint4B
         +0x078 ShareRank        : Ptr64 Uint4B
         +0x080 OwnerShareRank   : Uint4B
         +0x088 ReadyListHead    : [16] _LIST_ENTRY
         +0x188 ChildScbQueue    : _RTL_RB_TREE
         +0x198 Parent           : Ptr64 _KSCB
         +0x1a0 Root             : Ptr64 _KSCB
   +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
      +0x000 Flags            : UChar
      +0x000 State            : Pos 0, 3 Bits
      +0x000 Affinity         : Pos 3, 1 Bit
      +0x000 Priority         : Pos 4, 1 Bit
      +0x000 Apc              : Pos 5, 1 Bit
      +0x000 UserApc          : Pos 6, 1 Bit
      +0x000 Alert            : Pos 7, 1 Bit
   +0x071 Running          : UChar
   +0x072 Alerted          : [2] UChar
   +0x074 AutoBoostActive  : Pos 0, 1 Bit
   +0x074 ReadyTransition  : Pos 1, 1 Bit
   +0x074 WaitNext         : Pos 2, 1 Bit
   +0x074 SystemAffinityActive : Pos 3, 1 Bit
   +0x074 Alertable        : Pos 4, 1 Bit
   +0x074 UserStackWalkActive : Pos 5, 1 Bit
   +0x074 ApcInterruptRequest : Pos 6, 1 Bit
   +0x074 QuantumEndMigrate : Pos 7, 1 Bit
   +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
   +0x074 TimerActive      : Pos 9, 1 Bit
   +0x074 SystemThread     : Pos 10, 1 Bit
   +0x074 ProcessDetachActive : Pos 11, 1 Bit
   +0x074 CalloutActive    : Pos 12, 1 Bit
   +0x074 ScbReadyQueue    : Pos 13, 1 Bit
   +0x074 ApcQueueable     : Pos 14, 1 Bit
   +0x074 ReservedStackInUse : Pos 15, 1 Bit
   +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
   +0x074 TimerSuspended   : Pos 17, 1 Bit
   +0x074 SuspendedWaitMode : Pos 18, 1 Bit
   +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
   +0x074 CetUserShadowStack : Pos 20, 1 Bit
   +0x074 BypassProcessFreeze : Pos 21, 1 Bit
   +0x074 Reserved         : Pos 22, 10 Bits
   +0x074 MiscFlags        : Int4B
   +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
   +0x078 AutoAlignment    : Pos 2, 1 Bit
   +0x078 DisableBoost     : Pos 3, 1 Bit
   +0x078 AlertedByThreadId : Pos 4, 1 Bit
   +0x078 QuantumDonation  : Pos 5, 1 Bit
   +0x078 EnableStackSwap  : Pos 6, 1 Bit
   +0x078 GuiThread        : Pos 7, 1 Bit
   +0x078 DisableQuantum   : Pos 8, 1 Bit
   +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
   +0x078 DeferPreemption  : Pos 10, 1 Bit
   +0x078 QueueDeferPreemption : Pos 11, 1 Bit
   +0x078 ForceDeferSchedule : Pos 12, 1 Bit
   +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
   +0x078 FreezeCount      : Pos 14, 1 Bit
   +0x078 TerminationApcRequest : Pos 15, 1 Bit
   +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
   +0x078 KernelStackResident : Pos 17, 1 Bit
   +0x078 TerminateRequestReason : Pos 18, 2 Bits
   +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
   +0x078 RestrictedGuiThread : Pos 21, 1 Bit
   +0x078 VpBackingThread  : Pos 22, 1 Bit
   +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
   +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
   +0x078 ThreadFlags      : Int4B
   +0x07c Tag              : UChar
   +0x07d SystemHeteroCpuPolicy : UChar
   +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
   +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
   +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
   +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
   +0x07f SpecCtrl         : UChar
   +0x080 SystemCallNumber : Uint4B
   +0x084 ReadyTime        : Uint4B
   +0x088 FirstArgument    : Ptr64 Void
   +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
      +0x000 P1Home           : Uint8B
      +0x008 P2Home           : Uint8B
      +0x010 P3Home           : Uint8B
      +0x018 P4Home           : Uint8B
      +0x020 P5               : Uint8B
      +0x028 PreviousMode     : Char
      +0x028 InterruptRetpolineState : UChar
      +0x029 PreviousIrql     : UChar
      +0x02a FaultIndicator   : UChar
      +0x02a NmiMsrIbrs       : UChar
      +0x02b ExceptionActive  : UChar
      +0x02c MxCsr            : Uint4B
      +0x030 Rax              : Uint8B
      +0x038 Rcx              : Uint8B
      +0x040 Rdx              : Uint8B
      +0x048 R8               : Uint8B
      +0x050 R9               : Uint8B
      +0x058 R10              : Uint8B
      +0x060 R11              : Uint8B
      +0x068 GsBase           : Uint8B
      +0x068 GsSwap           : Uint8B
      +0x070 Xmm0             : _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x080 Xmm1             : _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x090 Xmm2             : _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x0a0 Xmm3             : _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x0b0 Xmm4             : _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x0c0 Xmm5             : _M128A
         +0x000 Low              : Uint8B
         +0x008 High             : Int8B
      +0x0d0 FaultAddress     : Uint8B
      +0x0d0 ContextRecord    : Uint8B
      +0x0d8 Dr0              : Uint8B
      +0x0e0 Dr1              : Uint8B
      +0x0e8 Dr2              : Uint8B
      +0x0f0 Dr3              : Uint8B
      +0x0f8 Dr6              : Uint8B
      +0x100 Dr7              : Uint8B
      +0x108 DebugControl     : Uint8B
      +0x110 LastBranchToRip  : Uint8B
      +0x118 LastBranchFromRip : Uint8B
      +0x120 LastExceptionToRip : Uint8B
      +0x128 LastExceptionFromRip : Uint8B
      +0x130 SegDs            : Uint2B
      +0x132 SegEs            : Uint2B
      +0x134 SegFs            : Uint2B
      +0x136 SegGs            : Uint2B
      +0x138 TrapFrame        : Uint8B
      +0x140 NmiPreviousSpecCtrl : Uint4B
      +0x144 NmiPreviousSpecCtrlPad : Uint4B
      +0x140 Rbx              : Uint8B
      +0x148 Rdi              : Uint8B
      +0x150 Rsi              : Uint8B
      +0x158 Rbp              : Uint8B
      +0x160 ErrorCode        : Uint8B
      +0x160 ExceptionFrame   : Uint8B
      +0x168 Rip              : Uint8B
      +0x170 SegCs            : Uint2B
      +0x172 Fill0            : UChar
      +0x173 Logging          : UChar
      +0x174 Fill1            : [2] Uint2B
      +0x178 EFlags           : Uint4B
      +0x17c Fill2            : Uint4B
      +0x180 Rsp              : Uint8B
      +0x188 SegSs            : Uint2B
      +0x18a Fill3            : Uint2B
      +0x18c Fill4            : Uint4B
   +0x098 ApcState         : _KAPC_STATE
      +0x000 ApcListHead      : [2] _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x020 Process          : Ptr64 _KPROCESS
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 ProfileListHead  : _LIST_ENTRY
         +0x028 DirectoryTableBase : Uint8B
         +0x030 ThreadListHead   : _LIST_ENTRY
         +0x040 ProcessLock      : Uint4B
         +0x044 ProcessTimerDelay : Uint4B
         +0x048 DeepFreezeStartTime : Uint8B
         +0x050 Affinity         : _KAFFINITY_EX
         +0x0f8 AffinityPadding  : [12] Uint8B
         +0x158 ReadyListHead    : _LIST_ENTRY
         +0x168 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x170 ActiveProcessors : _KAFFINITY_EX
         +0x218 ActiveProcessorsPadding : [12] Uint8B
         +0x278 AutoAlignment    : Pos 0, 1 Bit
         +0x278 DisableBoost     : Pos 1, 1 Bit
         +0x278 DisableQuantum   : Pos 2, 1 Bit
         +0x278 DeepFreeze       : Pos 3, 1 Bit
         +0x278 TimerVirtualization : Pos 4, 1 Bit
         +0x278 CheckStackExtents : Pos 5, 1 Bit
         +0x278 CacheIsolationEnabled : Pos 6, 1 Bit
         +0x278 PpmPolicy        : Pos 7, 3 Bits
         +0x278 VaSpaceDeleted   : Pos 10, 1 Bit
         +0x278 ReservedFlags    : Pos 11, 21 Bits
         +0x278 ProcessFlags     : Int4B
         +0x27c ActiveGroupsMask : Uint4B
         +0x280 BasePriority     : Char
         +0x281 QuantumReset     : Char
         +0x282 Visited          : Char
         +0x283 Flags            : _KEXECUTE_OPTIONS
         +0x284 ThreadSeed       : [20] Uint2B
         +0x2ac ThreadSeedPadding : [12] Uint2B
         +0x2c4 IdealProcessor   : [20] Uint2B
         +0x2ec IdealProcessorPadding : [12] Uint2B
         +0x304 IdealNode        : [20] Uint2B
         +0x32c IdealNodePadding : [12] Uint2B
         +0x344 IdealGlobalNode  : Uint2B
         +0x346 Spare1           : Uint2B
         +0x348 StackCount       : _KSTACK_COUNT
         +0x350 ProcessListEntry : _LIST_ENTRY
         +0x360 CycleTime        : Uint8B
         +0x368 ContextSwitches  : Uint8B
         +0x370 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x378 FreezeCount      : Uint4B
         +0x37c KernelTime       : Uint4B
         +0x380 UserTime         : Uint4B
         +0x384 ReadyTime        : Uint4B
         +0x388 UserDirectoryTableBase : Uint8B
         +0x390 AddressPolicy    : UChar
         +0x391 Spare2           : [71] UChar
         +0x3d8 InstrumentationCallback : Ptr64 Void
         +0x3e0 SecureState      : <anonymous-tag>
         +0x3e8 KernelWaitTime   : Uint8B
         +0x3f0 UserWaitTime     : Uint8B
         +0x3f8 EndPadding       : [8] Uint8B
      +0x028 InProgressFlags  : UChar
      +0x028 KernelApcInProgress : Pos 0, 1 Bit
      +0x028 SpecialApcInProgress : Pos 1, 1 Bit
      +0x029 KernelApcPending : UChar
      +0x02a UserApcPendingAll : UChar
      +0x02a SpecialUserApcPending : Pos 0, 1 Bit
      +0x02a UserApcPending   : Pos 1, 1 Bit
   +0x098 ApcStateFill     : [43] UChar
   +0x0c3 Priority         : Char
   +0x0c4 UserIdealProcessor : Uint4B
   +0x0c8 WaitStatus       : Int8B
   +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
      +0x000 WaitListEntry    : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x010 WaitType         : UChar
      +0x011 BlockState       : UChar
      +0x012 WaitKey          : Uint2B
      +0x014 SpareLong        : Int4B
      +0x018 Thread           : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x018 NotificationQueue : Ptr64 _KQUEUE
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 EntryListHead    : _LIST_ENTRY
         +0x028 CurrentCount     : Uint4B
         +0x02c MaximumCount     : Uint4B
         +0x030 ThreadListHead   : _LIST_ENTRY
      +0x020 Object           : Ptr64 Void
      +0x028 SparePtr         : Ptr64 Void
   +0x0d8 WaitListEntry    : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
   +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
      +0x000 Lock             : Int4B
      +0x000 LockNV           : Int4B
      +0x000 Type             : UChar
      +0x001 Signalling       : UChar
      +0x002 Size             : UChar
      +0x003 Reserved1        : UChar
      +0x000 TimerType        : UChar
      +0x001 TimerControlFlags : UChar
      +0x001 Absolute         : Pos 0, 1 Bit
      +0x001 Wake             : Pos 1, 1 Bit
      +0x001 EncodedTolerableDelay : Pos 2, 6 Bits
      +0x002 Hand             : UChar
      +0x003 TimerMiscFlags   : UChar
      +0x003 Index            : Pos 0, 6 Bits
      +0x003 Inserted         : Pos 6, 1 Bit
      +0x003 Expired          : Pos 7, 1 Bit
      +0x000 Timer2Type       : UChar
      +0x001 Timer2Flags      : UChar
      +0x001 Timer2Inserted   : Pos 0, 1 Bit
      +0x001 Timer2Expiring   : Pos 1, 1 Bit
      +0x001 Timer2CancelPending : Pos 2, 1 Bit
      +0x001 Timer2SetPending : Pos 3, 1 Bit
      +0x001 Timer2Running    : Pos 4, 1 Bit
      +0x001 Timer2Disabled   : Pos 5, 1 Bit
      +0x001 Timer2ReservedFlags : Pos 6, 2 Bits
      +0x002 Timer2ComponentId : UChar
      +0x003 Timer2RelativeId : UChar
      +0x000 QueueType        : UChar
      +0x001 QueueControlFlags : UChar
      +0x001 Abandoned        : Pos 0, 1 Bit
      +0x001 DisableIncrement : Pos 1, 1 Bit
      +0x001 QueueReservedControlFlags : Pos 2, 6 Bits
      +0x002 QueueSize        : UChar
      +0x003 QueueReserved    : UChar
      +0x000 ThreadType       : UChar
      +0x001 ThreadReserved   : UChar
      +0x002 ThreadControlFlags : UChar
      +0x002 CycleProfiling   : Pos 0, 1 Bit
      +0x002 CounterProfiling : Pos 1, 1 Bit
      +0x002 GroupScheduling  : Pos 2, 1 Bit
      +0x002 AffinitySet      : Pos 3, 1 Bit
      +0x002 Tagged           : Pos 4, 1 Bit
      +0x002 EnergyProfiling  : Pos 5, 1 Bit
      +0x002 SchedulerAssist  : Pos 6, 1 Bit
      +0x002 ThreadReservedControlFlags : Pos 7, 1 Bit
      +0x003 DebugActive      : UChar
      +0x003 ActiveDR7        : Pos 0, 1 Bit
      +0x003 Instrumented     : Pos 1, 1 Bit
      +0x003 Minimal          : Pos 2, 1 Bit
      +0x003 Reserved4        : Pos 3, 2 Bits
      +0x003 AltSyscall       : Pos 5, 1 Bit
      +0x003 UmsScheduled     : Pos 6, 1 Bit
      +0x003 UmsPrimary       : Pos 7, 1 Bit
      +0x000 MutantType       : UChar
      +0x001 MutantSize       : UChar
      +0x002 DpcActive        : UChar
      +0x003 MutantReserved   : UChar
      +0x004 SignalState      : Int4B
      +0x008 WaitListHead     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x0f0 Teb              : Ptr64 Void
   +0x0f8 RelativeTimerBias : Uint8B
   +0x100 Timer            : _KTIMER
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Lock             : Int4B
         +0x000 LockNV           : Int4B
         +0x000 Type             : UChar
         +0x001 Signalling       : UChar
         +0x002 Size             : UChar
         +0x003 Reserved1        : UChar
         +0x000 TimerType        : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Wake             : Pos 1, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 2, 6 Bits
         +0x002 Hand             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x000 Timer2Type       : UChar
         +0x001 Timer2Flags      : UChar
         +0x001 Timer2Inserted   : Pos 0, 1 Bit
         +0x001 Timer2Expiring   : Pos 1, 1 Bit
         +0x001 Timer2CancelPending : Pos 2, 1 Bit
         +0x001 Timer2SetPending : Pos 3, 1 Bit
         +0x001 Timer2Running    : Pos 4, 1 Bit
         +0x001 Timer2Disabled   : Pos 5, 1 Bit
         +0x001 Timer2ReservedFlags : Pos 6, 2 Bits
         +0x002 Timer2ComponentId : UChar
         +0x003 Timer2RelativeId : UChar
         +0x000 QueueType        : UChar
         +0x001 QueueControlFlags : UChar
         +0x001 Abandoned        : Pos 0, 1 Bit
         +0x001 DisableIncrement : Pos 1, 1 Bit
         +0x001 QueueReservedControlFlags : Pos 2, 6 Bits
         +0x002 QueueSize        : UChar
         +0x003 QueueReserved    : UChar
         +0x000 ThreadType       : UChar
         +0x001 ThreadReserved   : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CycleProfiling   : Pos 0, 1 Bit
         +0x002 CounterProfiling : Pos 1, 1 Bit
         +0x002 GroupScheduling  : Pos 2, 1 Bit
         +0x002 AffinitySet      : Pos 3, 1 Bit
         +0x002 Tagged           : Pos 4, 1 Bit
         +0x002 EnergyProfiling  : Pos 5, 1 Bit
         +0x002 SchedulerAssist  : Pos 6, 1 Bit
         +0x002 ThreadReservedControlFlags : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Minimal          : Pos 2, 1 Bit
         +0x003 Reserved4        : Pos 3, 2 Bits
         +0x003 AltSyscall       : Pos 5, 1 Bit
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x000 MutantType       : UChar
         +0x001 MutantSize       : UChar
         +0x002 DpcActive        : UChar
         +0x003 MutantReserved   : UChar
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
      +0x018 DueTime          : _ULARGE_INTEGER
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Uint4B
         +0x000 u                : <anonymous-tag>
         +0x000 QuadPart         : Uint8B
      +0x020 TimerListEntry   : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x030 Dpc              : Ptr64 _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x038 Processor        : Uint2B
      +0x03a TimerType        : Uint2B
      +0x03c Period           : Uint4B
   +0x140 WaitBlock        : [4] _KWAIT_BLOCK
      +0x000 WaitListEntry    : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x010 WaitType         : UChar
      +0x011 BlockState       : UChar
      +0x012 WaitKey          : Uint2B
      +0x014 SpareLong        : Int4B
      +0x018 Thread           : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x018 NotificationQueue : Ptr64 _KQUEUE
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 EntryListHead    : _LIST_ENTRY
         +0x028 CurrentCount     : Uint4B
         +0x02c MaximumCount     : Uint4B
         +0x030 ThreadListHead   : _LIST_ENTRY
      +0x020 Object           : Ptr64 Void
      +0x028 SparePtr         : Ptr64 Void
   +0x140 WaitBlockFill4   : [20] UChar
   +0x154 ContextSwitches  : Uint4B
   +0x140 WaitBlockFill5   : [68] UChar
   +0x184 State            : UChar
   +0x185 Spare13          : Char
   +0x186 WaitIrql         : UChar
   +0x187 WaitMode         : Char
   +0x140 WaitBlockFill6   : [116] UChar
   +0x1b4 WaitTime         : Uint4B
   +0x140 WaitBlockFill7   : [164] UChar
   +0x1e4 KernelApcDisable : Int2B
   +0x1e6 SpecialApcDisable : Int2B
   +0x1e4 CombinedApcDisable : Uint4B
   +0x140 WaitBlockFill8   : [40] UChar
   +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
      +0x000 WaitReasonBitMap : Uint8B
      +0x008 UserData         : Ptr64 _THREAD_PERFORMANCE_DATA
         +0x000 Size             : Uint2B
         +0x002 Version          : Uint2B
         +0x004 ProcessorNumber  : _PROCESSOR_NUMBER
         +0x008 ContextSwitches  : Uint4B
         +0x00c HwCountersCount  : Uint4B
         +0x010 UpdateCount      : Uint8B
         +0x018 WaitReasonBitMap : Uint8B
         +0x020 HardwareCounters : Uint8B
         +0x028 CycleTime        : _COUNTER_READING
         +0x040 HwCounters       : [16] _COUNTER_READING
      +0x010 Flags            : Uint4B
      +0x014 ContextSwitches  : Uint4B
      +0x018 CycleTimeBias    : Uint8B
      +0x020 HardwareCounters : Uint8B
      +0x028 HwCounter        : [16] _COUNTER_READING
         +0x000 Type             : _HARDWARE_COUNTER_TYPE
         +0x004 Index            : Uint4B
         +0x008 Start            : Uint8B
         +0x010 Total            : Uint8B
   +0x140 WaitBlockFill9   : [88] UChar
   +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
      +0x000 Prev             : Ptr64 _XSTATE_SAVE
         +0x000 Prev             : Ptr64 _XSTATE_SAVE
         +0x008 Thread           : Ptr64 _KTHREAD
         +0x010 Level            : UChar
         +0x018 XStateContext    : _XSTATE_CONTEXT
      +0x008 Thread           : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x010 Level            : UChar
      +0x018 XStateContext    : _XSTATE_CONTEXT
         +0x000 Mask             : Uint8B
         +0x008 Length           : Uint4B
         +0x00c Reserved1        : Uint4B
         +0x010 Area             : Ptr64 _XSAVE_AREA
         +0x018 Buffer           : Ptr64 Void
   +0x140 WaitBlockFill10  : [136] UChar
   +0x1c8 Win32Thread      : Ptr64 Void
   +0x140 WaitBlockFill11  : [176] UChar
   +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
      +0x000 UmsContext       : Ptr64 _RTL_UMS_CONTEXT
         +0x000 Link             : _SINGLE_LIST_ENTRY
         +0x010 Context          : _CONTEXT
         +0x4e0 Teb              : Ptr64 Void
         +0x4e8 UserContext      : Ptr64 Void
         +0x4f0 ScheduledThread  : Pos 0, 1 Bit
         +0x4f0 Suspended        : Pos 1, 1 Bit
         +0x4f0 VolatileContext  : Pos 2, 1 Bit
         +0x4f0 Terminated       : Pos 3, 1 Bit
         +0x4f0 DebugActive      : Pos 4, 1 Bit
         +0x4f0 RunningOnSelfThread : Pos 5, 1 Bit
         +0x4f0 DenyRunningOnSelfThread : Pos 6, 1 Bit
         +0x4f0 Flags            : Int4B
         +0x4f8 KernelUpdateLock : Pos 0, 2 Bits
         +0x4f8 PrimaryClientID  : Pos 2, 62 Bits
         +0x4f8 ContextLock      : Uint8B
         +0x500 PrimaryUmsContext : Ptr64 _RTL_UMS_CONTEXT
         +0x508 SwitchCount      : Uint4B
         +0x50c KernelYieldCount : Uint4B
         +0x510 MixedYieldCount  : Uint4B
         +0x514 YieldCount       : Uint4B
      +0x008 CompletionListEntry : Ptr64 _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
      +0x010 CompletionListEvent : Ptr64 _KEVENT
         +0x000 Header           : _DISPATCHER_HEADER
      +0x018 ServiceSequenceNumber : Uint4B
      +0x020 UmsQueue         : _KQUEUE
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 EntryListHead    : _LIST_ENTRY
         +0x028 CurrentCount     : Uint4B
         +0x02c MaximumCount     : Uint4B
         +0x030 ThreadListHead   : _LIST_ENTRY
      +0x060 QueueEntry       : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x070 YieldingUmsContext : Ptr64 _RTL_UMS_CONTEXT
         +0x000 Link             : _SINGLE_LIST_ENTRY
         +0x010 Context          : _CONTEXT
         +0x4e0 Teb              : Ptr64 Void
         +0x4e8 UserContext      : Ptr64 Void
         +0x4f0 ScheduledThread  : Pos 0, 1 Bit
         +0x4f0 Suspended        : Pos 1, 1 Bit
         +0x4f0 VolatileContext  : Pos 2, 1 Bit
         +0x4f0 Terminated       : Pos 3, 1 Bit
         +0x4f0 DebugActive      : Pos 4, 1 Bit
         +0x4f0 RunningOnSelfThread : Pos 5, 1 Bit
         +0x4f0 DenyRunningOnSelfThread : Pos 6, 1 Bit
         +0x4f0 Flags            : Int4B
         +0x4f8 KernelUpdateLock : Pos 0, 2 Bits
         +0x4f8 PrimaryClientID  : Pos 2, 62 Bits
         +0x4f8 ContextLock      : Uint8B
         +0x500 PrimaryUmsContext : Ptr64 _RTL_UMS_CONTEXT
         +0x508 SwitchCount      : Uint4B
         +0x50c KernelYieldCount : Uint4B
         +0x510 MixedYieldCount  : Uint4B
         +0x514 YieldCount       : Uint4B
      +0x078 YieldingParam    : Ptr64 Void
      +0x080 UmsTeb           : Ptr64 Void
      +0x020 UmsAssociatedQueue : Ptr64 _KQUEUE
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 EntryListHead    : _LIST_ENTRY
         +0x028 CurrentCount     : Uint4B
         +0x02c MaximumCount     : Uint4B
         +0x030 ThreadListHead   : _LIST_ENTRY
      +0x028 UmsQueueListEntry : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x030 UmsWaitEvent     : _KEVENT
         +0x000 Header           : _DISPATCHER_HEADER
      +0x048 StagingArea      : Ptr64 Void
      +0x050 UmsPrimaryDeliveredContext : Pos 0, 1 Bit
      +0x050 UmsAssociatedQueueUsed : Pos 1, 1 Bit
      +0x050 UmsThreadParked  : Pos 2, 1 Bit
      +0x050 UmsFlags         : Uint4B
   +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
      +0x000 P1Home           : Uint8B
      +0x008 P2Home           : Uint8B
      +0x010 P3Home           : Uint8B
      +0x018 P4Home           : Uint8B
      +0x020 StackTop         : Ptr64 Void
      +0x028 StackSize        : Uint8B
      +0x030 RspOffset        : Uint8B
      +0x038 Rip              : Uint8B
      +0x040 FltSave          : Ptr64 _XSAVE_FORMAT
         +0x000 ControlWord      : Uint2B
         +0x002 StatusWord       : Uint2B
         +0x004 TagWord          : UChar
         +0x005 Reserved1        : UChar
         +0x006 ErrorOpcode      : Uint2B
         +0x008 ErrorOffset      : Uint4B
         +0x00c ErrorSelector    : Uint2B
         +0x00e Reserved2        : Uint2B
         +0x010 DataOffset       : Uint4B
         +0x014 DataSelector     : Uint2B
         +0x016 Reserved3        : Uint2B
         +0x018 MxCsr            : Uint4B
         +0x01c MxCsr_Mask       : Uint4B
         +0x020 FloatRegisters   : [8] _M128A
         +0x0a0 XmmRegisters     : [16] _M128A
         +0x1a0 Reserved4        : [96] UChar
      +0x048 Volatile         : Pos 0, 1 Bit
      +0x048 Reserved         : Pos 1, 63 Bits
      +0x048 Flags            : Uint8B
      +0x050 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x000 P1Home           : Uint8B
         +0x008 P2Home           : Uint8B
         +0x010 P3Home           : Uint8B
         +0x018 P4Home           : Uint8B
         +0x020 P5               : Uint8B
         +0x028 PreviousMode     : Char
         +0x028 InterruptRetpolineState : UChar
         +0x029 PreviousIrql     : UChar
         +0x02a FaultIndicator   : UChar
         +0x02a NmiMsrIbrs       : UChar
         +0x02b ExceptionActive  : UChar
         +0x02c MxCsr            : Uint4B
         +0x030 Rax              : Uint8B
         +0x038 Rcx              : Uint8B
         +0x040 Rdx              : Uint8B
         +0x048 R8               : Uint8B
         +0x050 R9               : Uint8B
         +0x058 R10              : Uint8B
         +0x060 R11              : Uint8B
         +0x068 GsBase           : Uint8B
         +0x068 GsSwap           : Uint8B
         +0x070 Xmm0             : _M128A
         +0x080 Xmm1             : _M128A
         +0x090 Xmm2             : _M128A
         +0x0a0 Xmm3             : _M128A
         +0x0b0 Xmm4             : _M128A
         +0x0c0 Xmm5             : _M128A
         +0x0d0 FaultAddress     : Uint8B
         +0x0d0 ContextRecord    : Uint8B
         +0x0d8 Dr0              : Uint8B
         +0x0e0 Dr1              : Uint8B
         +0x0e8 Dr2              : Uint8B
         +0x0f0 Dr3              : Uint8B
         +0x0f8 Dr6              : Uint8B
         +0x100 Dr7              : Uint8B
         +0x108 DebugControl     : Uint8B
         +0x110 LastBranchToRip  : Uint8B
         +0x118 LastBranchFromRip : Uint8B
         +0x120 LastExceptionToRip : Uint8B
         +0x128 LastExceptionFromRip : Uint8B
         +0x130 SegDs            : Uint2B
         +0x132 SegEs            : Uint2B
         +0x134 SegFs            : Uint2B
         +0x136 SegGs            : Uint2B
         +0x138 TrapFrame        : Uint8B
         +0x140 NmiPreviousSpecCtrl : Uint4B
         +0x144 NmiPreviousSpecCtrlPad : Uint4B
         +0x140 Rbx              : Uint8B
         +0x148 Rdi              : Uint8B
         +0x150 Rsi              : Uint8B
         +0x158 Rbp              : Uint8B
         +0x160 ErrorCode        : Uint8B
         +0x160 ExceptionFrame   : Uint8B
         +0x168 Rip              : Uint8B
         +0x170 SegCs            : Uint2B
         +0x172 Fill0            : UChar
         +0x173 Logging          : UChar
         +0x174 Fill1            : [2] Uint2B
         +0x178 EFlags           : Uint4B
         +0x17c Fill2            : Uint4B
         +0x180 Rsp              : Uint8B
         +0x188 SegSs            : Uint2B
         +0x18a Fill3            : Uint2B
         +0x18c Fill4            : Uint4B
      +0x058 ExceptionFrame   : Ptr64 _KEXCEPTION_FRAME
         +0x000 P1Home           : Uint8B
         +0x008 P2Home           : Uint8B
         +0x010 P3Home           : Uint8B
         +0x018 P4Home           : Uint8B
         +0x020 P5               : Uint8B
         +0x028 Spare1           : Uint8B
         +0x030 Xmm6             : _M128A
         +0x040 Xmm7             : _M128A
         +0x050 Xmm8             : _M128A
         +0x060 Xmm9             : _M128A
         +0x070 Xmm10            : _M128A
         +0x080 Xmm11            : _M128A
         +0x090 Xmm12            : _M128A
         +0x0a0 Xmm13            : _M128A
         +0x0b0 Xmm14            : _M128A
         +0x0c0 Xmm15            : _M128A
         +0x0d0 TrapFrame        : Uint8B
         +0x0d8 OutputBuffer     : Uint8B
         +0x0e0 OutputLength     : Uint8B
         +0x0e8 Spare2           : Uint8B
         +0x0f0 MxCsr            : Uint8B
         +0x0f8 Rbp              : Uint8B
         +0x100 Rbx              : Uint8B
         +0x108 Rdi              : Uint8B
         +0x110 Rsi              : Uint8B
         +0x118 R12              : Uint8B
         +0x120 R13              : Uint8B
         +0x128 R14              : Uint8B
         +0x130 R15              : Uint8B
         +0x138 Return           : Uint8B
      +0x060 SourceThread     : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x068 Return           : Uint8B
   +0x200 ThreadFlags2     : Int4B
   +0x200 BamQosLevel      : Pos 0, 8 Bits
   +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
   +0x204 Spare21          : Uint4B
   +0x208 QueueListEntry   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x218 NextProcessor    : Uint4B
   +0x218 NextProcessorNumber : Pos 0, 31 Bits
   +0x218 SharedReadyQueue : Pos 31, 1 Bit
   +0x21c QueuePriority    : Int4B
   +0x220 Process          : Ptr64 _KPROCESS
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Lock             : Int4B
         +0x000 LockNV           : Int4B
         +0x000 Type             : UChar
         +0x001 Signalling       : UChar
         +0x002 Size             : UChar
         +0x003 Reserved1        : UChar
         +0x000 TimerType        : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Wake             : Pos 1, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 2, 6 Bits
         +0x002 Hand             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x000 Timer2Type       : UChar
         +0x001 Timer2Flags      : UChar
         +0x001 Timer2Inserted   : Pos 0, 1 Bit
         +0x001 Timer2Expiring   : Pos 1, 1 Bit
         +0x001 Timer2CancelPending : Pos 2, 1 Bit
         +0x001 Timer2SetPending : Pos 3, 1 Bit
         +0x001 Timer2Running    : Pos 4, 1 Bit
         +0x001 Timer2Disabled   : Pos 5, 1 Bit
         +0x001 Timer2ReservedFlags : Pos 6, 2 Bits
         +0x002 Timer2ComponentId : UChar
         +0x003 Timer2RelativeId : UChar
         +0x000 QueueType        : UChar
         +0x001 QueueControlFlags : UChar
         +0x001 Abandoned        : Pos 0, 1 Bit
         +0x001 DisableIncrement : Pos 1, 1 Bit
         +0x001 QueueReservedControlFlags : Pos 2, 6 Bits
         +0x002 QueueSize        : UChar
         +0x003 QueueReserved    : UChar
         +0x000 ThreadType       : UChar
         +0x001 ThreadReserved   : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CycleProfiling   : Pos 0, 1 Bit
         +0x002 CounterProfiling : Pos 1, 1 Bit
         +0x002 GroupScheduling  : Pos 2, 1 Bit
         +0x002 AffinitySet      : Pos 3, 1 Bit
         +0x002 Tagged           : Pos 4, 1 Bit
         +0x002 EnergyProfiling  : Pos 5, 1 Bit
         +0x002 SchedulerAssist  : Pos 6, 1 Bit
         +0x002 ThreadReservedControlFlags : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Minimal          : Pos 2, 1 Bit
         +0x003 Reserved4        : Pos 3, 2 Bits
         +0x003 AltSyscall       : Pos 5, 1 Bit
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x000 MutantType       : UChar
         +0x001 MutantSize       : UChar
         +0x002 DpcActive        : UChar
         +0x003 MutantReserved   : UChar
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
      +0x018 ProfileListHead  : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x028 DirectoryTableBase : Uint8B
      +0x030 ThreadListHead   : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x040 ProcessLock      : Uint4B
      +0x044 ProcessTimerDelay : Uint4B
      +0x048 DeepFreezeStartTime : Uint8B
      +0x050 Affinity         : _KAFFINITY_EX
         +0x000 Count            : Uint2B
         +0x002 Size             : Uint2B
         +0x004 Reserved         : Uint4B
         +0x008 Bitmap           : [20] Uint8B
      +0x0f8 AffinityPadding  : [12] Uint8B
      +0x158 ReadyListHead    : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x168 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
      +0x170 ActiveProcessors : _KAFFINITY_EX
         +0x000 Count            : Uint2B
         +0x002 Size             : Uint2B
         +0x004 Reserved         : Uint4B
         +0x008 Bitmap           : [20] Uint8B
      +0x218 ActiveProcessorsPadding : [12] Uint8B
      +0x278 AutoAlignment    : Pos 0, 1 Bit
      +0x278 DisableBoost     : Pos 1, 1 Bit
      +0x278 DisableQuantum   : Pos 2, 1 Bit
      +0x278 DeepFreeze       : Pos 3, 1 Bit
      +0x278 TimerVirtualization : Pos 4, 1 Bit
      +0x278 CheckStackExtents : Pos 5, 1 Bit
      +0x278 CacheIsolationEnabled : Pos 6, 1 Bit
      +0x278 PpmPolicy        : Pos 7, 3 Bits
      +0x278 VaSpaceDeleted   : Pos 10, 1 Bit
      +0x278 ReservedFlags    : Pos 11, 21 Bits
      +0x278 ProcessFlags     : Int4B
      +0x27c ActiveGroupsMask : Uint4B
      +0x280 BasePriority     : Char
      +0x281 QuantumReset     : Char
      +0x282 Visited          : Char
      +0x283 Flags            : _KEXECUTE_OPTIONS
         +0x000 ExecuteDisable   : Pos 0, 1 Bit
         +0x000 ExecuteEnable    : Pos 1, 1 Bit
         +0x000 DisableThunkEmulation : Pos 2, 1 Bit
         +0x000 Permanent        : Pos 3, 1 Bit
         +0x000 ExecuteDispatchEnable : Pos 4, 1 Bit
         +0x000 ImageDispatchEnable : Pos 5, 1 Bit
         +0x000 DisableExceptionChainValidation : Pos 6, 1 Bit
         +0x000 Spare            : Pos 7, 1 Bit
         +0x000 ExecuteOptions   : UChar
         +0x000 ExecuteOptionsNV : UChar
      +0x284 ThreadSeed       : [20] Uint2B
      +0x2ac ThreadSeedPadding : [12] Uint2B
      +0x2c4 IdealProcessor   : [20] Uint2B
      +0x2ec IdealProcessorPadding : [12] Uint2B
      +0x304 IdealNode        : [20] Uint2B
      +0x32c IdealNodePadding : [12] Uint2B
      +0x344 IdealGlobalNode  : Uint2B
      +0x346 Spare1           : Uint2B
      +0x348 StackCount       : _KSTACK_COUNT
         +0x000 Value            : Int4B
         +0x000 State            : Pos 0, 3 Bits
         +0x000 StackCount       : Pos 3, 29 Bits
      +0x350 ProcessListEntry : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x360 CycleTime        : Uint8B
      +0x368 ContextSwitches  : Uint8B
      +0x370 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x000 Policy           : _KSCHEDULING_GROUP_POLICY
         +0x008 RelativeWeight   : Uint4B
         +0x00c ChildMinRate     : Uint4B
         +0x010 ChildMinWeight   : Uint4B
         +0x014 ChildTotalWeight : Uint4B
         +0x018 QueryHistoryTimeStamp : Uint8B
         +0x020 NotificationCycles : Int8B
         +0x028 MaxQuotaLimitCycles : Int8B
         +0x030 MaxQuotaCyclesRemaining : Int8B
         +0x038 SchedulingGroupList : _LIST_ENTRY
         +0x038 Sibling          : _LIST_ENTRY
         +0x048 NotificationDpc  : Ptr64 _KDPC
         +0x050 ChildList        : _LIST_ENTRY
         +0x060 Parent           : Ptr64 _KSCHEDULING_GROUP
         +0x080 PerProcessor     : [1] _KSCB
      +0x378 FreezeCount      : Uint4B
      +0x37c KernelTime       : Uint4B
      +0x380 UserTime         : Uint4B
      +0x384 ReadyTime        : Uint4B
      +0x388 UserDirectoryTableBase : Uint8B
      +0x390 AddressPolicy    : UChar
      +0x391 Spare2           : [71] UChar
      +0x3d8 InstrumentationCallback : Ptr64 Void
      +0x3e0 SecureState      : <anonymous-tag>
         +0x000 SecureHandle     : Uint8B
         +0x000 Flags            : <anonymous-tag>
      +0x3e8 KernelWaitTime   : Uint8B
      +0x3f0 UserWaitTime     : Uint8B
      +0x3f8 EndPadding       : [8] Uint8B
   +0x228 UserAffinity     : _GROUP_AFFINITY
      +0x000 Mask             : Uint8B
      +0x008 Group            : Uint2B
      +0x00a Reserved         : [3] Uint2B
   +0x228 UserAffinityFill : [10] UChar
   +0x232 PreviousMode     : Char
   +0x233 BasePriority     : Char
   +0x234 PriorityDecrement : Char
   +0x234 ForegroundBoost  : Pos 0, 4 Bits
   +0x234 UnusualBoost     : Pos 4, 4 Bits
   +0x235 Preempted        : UChar
   +0x236 AdjustReason     : UChar
   +0x237 AdjustIncrement  : Char
   +0x238 AffinityVersion  : Uint8B
   +0x240 Affinity         : _GROUP_AFFINITY
      +0x000 Mask             : Uint8B
      +0x008 Group            : Uint2B
      +0x00a Reserved         : [3] Uint2B
   +0x240 AffinityFill     : [10] UChar
   +0x24a ApcStateIndex    : UChar
   +0x24b WaitBlockCount   : UChar
   +0x24c IdealProcessor   : Uint4B
   +0x250 NpxState         : Uint8B
   +0x258 SavedApcState    : _KAPC_STATE
      +0x000 ApcListHead      : [2] _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x020 Process          : Ptr64 _KPROCESS
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 ProfileListHead  : _LIST_ENTRY
         +0x028 DirectoryTableBase : Uint8B
         +0x030 ThreadListHead   : _LIST_ENTRY
         +0x040 ProcessLock      : Uint4B
         +0x044 ProcessTimerDelay : Uint4B
         +0x048 DeepFreezeStartTime : Uint8B
         +0x050 Affinity         : _KAFFINITY_EX
         +0x0f8 AffinityPadding  : [12] Uint8B
         +0x158 ReadyListHead    : _LIST_ENTRY
         +0x168 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x170 ActiveProcessors : _KAFFINITY_EX
         +0x218 ActiveProcessorsPadding : [12] Uint8B
         +0x278 AutoAlignment    : Pos 0, 1 Bit
         +0x278 DisableBoost     : Pos 1, 1 Bit
         +0x278 DisableQuantum   : Pos 2, 1 Bit
         +0x278 DeepFreeze       : Pos 3, 1 Bit
         +0x278 TimerVirtualization : Pos 4, 1 Bit
         +0x278 CheckStackExtents : Pos 5, 1 Bit
         +0x278 CacheIsolationEnabled : Pos 6, 1 Bit
         +0x278 PpmPolicy        : Pos 7, 3 Bits
         +0x278 VaSpaceDeleted   : Pos 10, 1 Bit
         +0x278 ReservedFlags    : Pos 11, 21 Bits
         +0x278 ProcessFlags     : Int4B
         +0x27c ActiveGroupsMask : Uint4B
         +0x280 BasePriority     : Char
         +0x281 QuantumReset     : Char
         +0x282 Visited          : Char
         +0x283 Flags            : _KEXECUTE_OPTIONS
         +0x284 ThreadSeed       : [20] Uint2B
         +0x2ac ThreadSeedPadding : [12] Uint2B
         +0x2c4 IdealProcessor   : [20] Uint2B
         +0x2ec IdealProcessorPadding : [12] Uint2B
         +0x304 IdealNode        : [20] Uint2B
         +0x32c IdealNodePadding : [12] Uint2B
         +0x344 IdealGlobalNode  : Uint2B
         +0x346 Spare1           : Uint2B
         +0x348 StackCount       : _KSTACK_COUNT
         +0x350 ProcessListEntry : _LIST_ENTRY
         +0x360 CycleTime        : Uint8B
         +0x368 ContextSwitches  : Uint8B
         +0x370 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x378 FreezeCount      : Uint4B
         +0x37c KernelTime       : Uint4B
         +0x380 UserTime         : Uint4B
         +0x384 ReadyTime        : Uint4B
         +0x388 UserDirectoryTableBase : Uint8B
         +0x390 AddressPolicy    : UChar
         +0x391 Spare2           : [71] UChar
         +0x3d8 InstrumentationCallback : Ptr64 Void
         +0x3e0 SecureState      : <anonymous-tag>
         +0x3e8 KernelWaitTime   : Uint8B
         +0x3f0 UserWaitTime     : Uint8B
         +0x3f8 EndPadding       : [8] Uint8B
      +0x028 InProgressFlags  : UChar
      +0x028 KernelApcInProgress : Pos 0, 1 Bit
      +0x028 SpecialApcInProgress : Pos 1, 1 Bit
      +0x029 KernelApcPending : UChar
      +0x02a UserApcPendingAll : UChar
      +0x02a SpecialUserApcPending : Pos 0, 1 Bit
      +0x02a UserApcPending   : Pos 1, 1 Bit
   +0x258 SavedApcStateFill : [43] UChar
   +0x283 WaitReason       : UChar
   +0x284 SuspendCount     : Char
   +0x285 Saturation       : Char
   +0x286 SListFaultCount  : Uint2B
   +0x288 SchedulerApc     : _KAPC
      +0x000 Type             : UChar
      +0x001 AllFlags         : UChar
      +0x001 CallbackDataContext : Pos 0, 1 Bit
      +0x001 Unused           : Pos 1, 7 Bits
      +0x002 Size             : UChar
      +0x003 SpareByte1       : UChar
      +0x004 SpareLong0       : Uint4B
      +0x008 Thread           : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x010 ApcListEntry     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x020 KernelRoutine    : Ptr64        void 
      +0x028 RundownRoutine   : Ptr64        void 
      +0x030 NormalRoutine    : Ptr64        void 
      +0x020 Reserved         : [3] Ptr64 Void
      +0x038 NormalContext    : Ptr64 Void
      +0x040 SystemArgument1  : Ptr64 Void
      +0x048 SystemArgument2  : Ptr64 Void
      +0x050 ApcStateIndex    : Char
      +0x051 ApcMode          : Char
      +0x052 Inserted         : UChar
   +0x288 SchedulerApcFill1 : [3] UChar
   +0x28b QuantumReset     : UChar
   +0x288 SchedulerApcFill2 : [4] UChar
   +0x28c KernelTime       : Uint4B
   +0x288 SchedulerApcFill3 : [64] UChar
   +0x2c8 WaitPrcb         : Ptr64 _KPRCB
      +0x000 MxCsr            : Uint4B
      +0x004 LegacyNumber     : UChar
      +0x005 ReservedMustBeZero : UChar
      +0x006 InterruptRequest : UChar
      +0x007 IdleHalt         : UChar
      +0x008 CurrentThread    : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x010 NextThread       : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x018 IdleThread       : Ptr64 _KTHREAD
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 SListFaultAddress : Ptr64 Void
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr64 Void
         +0x030 StackLimit       : Ptr64 Void
         +0x038 StackBase        : Ptr64 Void
         +0x040 ThreadLock       : Uint8B
         +0x048 CycleTime        : Uint8B
         +0x050 CurrentRunTime   : Uint4B
         +0x054 ExpectedRunTime  : Uint4B
         +0x058 KernelStack      : Ptr64 Void
         +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
         +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
         +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x071 Running          : UChar
         +0x072 Alerted          : [2] UChar
         +0x074 AutoBoostActive  : Pos 0, 1 Bit
         +0x074 ReadyTransition  : Pos 1, 1 Bit
         +0x074 WaitNext         : Pos 2, 1 Bit
         +0x074 SystemAffinityActive : Pos 3, 1 Bit
         +0x074 Alertable        : Pos 4, 1 Bit
         +0x074 UserStackWalkActive : Pos 5, 1 Bit
         +0x074 ApcInterruptRequest : Pos 6, 1 Bit
         +0x074 QuantumEndMigrate : Pos 7, 1 Bit
         +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
         +0x074 TimerActive      : Pos 9, 1 Bit
         +0x074 SystemThread     : Pos 10, 1 Bit
         +0x074 ProcessDetachActive : Pos 11, 1 Bit
         +0x074 CalloutActive    : Pos 12, 1 Bit
         +0x074 ScbReadyQueue    : Pos 13, 1 Bit
         +0x074 ApcQueueable     : Pos 14, 1 Bit
         +0x074 ReservedStackInUse : Pos 15, 1 Bit
         +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
         +0x074 TimerSuspended   : Pos 17, 1 Bit
         +0x074 SuspendedWaitMode : Pos 18, 1 Bit
         +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
         +0x074 CetUserShadowStack : Pos 20, 1 Bit
         +0x074 BypassProcessFreeze : Pos 21, 1 Bit
         +0x074 Reserved         : Pos 22, 10 Bits
         +0x074 MiscFlags        : Int4B
         +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
         +0x078 AutoAlignment    : Pos 2, 1 Bit
         +0x078 DisableBoost     : Pos 3, 1 Bit
         +0x078 AlertedByThreadId : Pos 4, 1 Bit
         +0x078 QuantumDonation  : Pos 5, 1 Bit
         +0x078 EnableStackSwap  : Pos 6, 1 Bit
         +0x078 GuiThread        : Pos 7, 1 Bit
         +0x078 DisableQuantum   : Pos 8, 1 Bit
         +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
         +0x078 DeferPreemption  : Pos 10, 1 Bit
         +0x078 QueueDeferPreemption : Pos 11, 1 Bit
         +0x078 ForceDeferSchedule : Pos 12, 1 Bit
         +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
         +0x078 FreezeCount      : Pos 14, 1 Bit
         +0x078 TerminationApcRequest : Pos 15, 1 Bit
         +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
         +0x078 KernelStackResident : Pos 17, 1 Bit
         +0x078 TerminateRequestReason : Pos 18, 2 Bits
         +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
         +0x078 RestrictedGuiThread : Pos 21, 1 Bit
         +0x078 VpBackingThread  : Pos 22, 1 Bit
         +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit
         +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
         +0x078 ThreadFlags      : Int4B
         +0x07c Tag              : UChar
         +0x07d SystemHeteroCpuPolicy : UChar
         +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
         +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
         +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
         +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
         +0x07f SpecCtrl         : UChar
         +0x080 SystemCallNumber : Uint4B
         +0x084 ReadyTime        : Uint4B
         +0x088 FirstArgument    : Ptr64 Void
         +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
         +0x098 ApcState         : _KAPC_STATE
         +0x098 ApcStateFill     : [43] UChar
         +0x0c3 Priority         : Char
         +0x0c4 UserIdealProcessor : Uint4B
         +0x0c8 WaitStatus       : Int8B
         +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
         +0x0d8 WaitListEntry    : _LIST_ENTRY
         +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
         +0x0f0 Teb              : Ptr64 Void
         +0x0f8 RelativeTimerBias : Uint8B
         +0x100 Timer            : _KTIMER
         +0x140 WaitBlock        : [4] _KWAIT_BLOCK
         +0x140 WaitBlockFill4   : [20] UChar
         +0x154 ContextSwitches  : Uint4B
         +0x140 WaitBlockFill5   : [68] UChar
         +0x184 State            : UChar
         +0x185 Spare13          : Char
         +0x186 WaitIrql         : UChar
         +0x187 WaitMode         : Char
         +0x140 WaitBlockFill6   : [116] UChar
         +0x1b4 WaitTime         : Uint4B
         +0x140 WaitBlockFill7   : [164] UChar
         +0x1e4 KernelApcDisable : Int2B
         +0x1e6 SpecialApcDisable : Int2B
         +0x1e4 CombinedApcDisable : Uint4B
         +0x140 WaitBlockFill8   : [40] UChar
         +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
         +0x140 WaitBlockFill9   : [88] UChar
         +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
         +0x140 WaitBlockFill10  : [136] UChar
         +0x1c8 Win32Thread      : Ptr64 Void
         +0x140 WaitBlockFill11  : [176] UChar
         +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
         +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
         +0x200 ThreadFlags2     : Int4B
         +0x200 BamQosLevel      : Pos 0, 8 Bits
         +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits
         +0x204 Spare21          : Uint4B
         +0x208 QueueListEntry   : _LIST_ENTRY
         +0x218 NextProcessor    : Uint4B
         +0x218 NextProcessorNumber : Pos 0, 31 Bits
         +0x218 SharedReadyQueue : Pos 31, 1 Bit
         +0x21c QueuePriority    : Int4B
         +0x220 Process          : Ptr64 _KPROCESS
         +0x228 UserAffinity     : _GROUP_AFFINITY
         +0x228 UserAffinityFill : [10] UChar
         +0x232 PreviousMode     : Char
         +0x233 BasePriority     : Char
         +0x234 PriorityDecrement : Char
         +0x234 ForegroundBoost  : Pos 0, 4 Bits
         +0x234 UnusualBoost     : Pos 4, 4 Bits
         +0x235 Preempted        : UChar
         +0x236 AdjustReason     : UChar
         +0x237 AdjustIncrement  : Char
         +0x238 AffinityVersion  : Uint8B
         +0x240 Affinity         : _GROUP_AFFINITY
         +0x240 AffinityFill     : [10] UChar
         +0x24a ApcStateIndex    : UChar
         +0x24b WaitBlockCount   : UChar
         +0x24c IdealProcessor   : Uint4B
         +0x250 NpxState         : Uint8B
         +0x258 SavedApcState    : _KAPC_STATE
         +0x258 SavedApcStateFill : [43] UChar
         +0x283 WaitReason       : UChar
         +0x284 SuspendCount     : Char
         +0x285 Saturation       : Char
         +0x286 SListFaultCount  : Uint2B
         +0x288 SchedulerApc     : _KAPC
         +0x288 SchedulerApcFill1 : [3] UChar
         +0x28b QuantumReset     : UChar
         +0x288 SchedulerApcFill2 : [4] UChar
         +0x28c KernelTime       : Uint4B
         +0x288 SchedulerApcFill3 : [64] UChar
         +0x2c8 WaitPrcb         : Ptr64 _KPRCB
         +0x288 SchedulerApcFill4 : [72] UChar
         +0x2d0 LegoData         : Ptr64 Void
         +0x288 SchedulerApcFill5 : [83] UChar
         +0x2db CallbackNestingLevel : UChar
         +0x2dc UserTime         : Uint4B
         +0x2e0 SuspendEvent     : _KEVENT
         +0x2f8 ThreadListEntry  : _LIST_ENTRY
         +0x308 MutantListHead   : _LIST_ENTRY
         +0x318 AbEntrySummary   : UChar
         +0x319 AbWaitEntryCount : UChar
         +0x31a AbAllocationRegionCount : UChar
         +0x31b SystemPriority   : Char
         +0x31c SecureThreadCookie : Uint4B
         +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
         +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
         +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
         +0x338 PriorityFloorCounts : [16] UChar
         +0x348 PriorityFloorCountsReserved : [16] UChar
         +0x358 PriorityFloorSummary : Uint4B
         +0x35c AbCompletedIoBoostCount : Int4B
         +0x360 AbCompletedIoQoSBoostCount : Int4B
         +0x364 KeReferenceCount : Int2B
         +0x366 AbOrphanedEntrySummary : UChar
         +0x367 AbOwnedEntryCount : UChar
         +0x368 ForegroundLossTime : Uint4B
         +0x370 GlobalForegroundListEntry : _LIST_ENTRY
         +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x378 InGlobalForegroundList : Uint8B
         +0x380 ReadOperationCount : Int8B
         +0x388 WriteOperationCount : Int8B
         +0x390 OtherOperationCount : Int8B
         +0x398 ReadTransferCount : Int8B
         +0x3a0 WriteTransferCount : Int8B
         +0x3a8 OtherTransferCount : Int8B
         +0x3b0 QueuedScb        : Ptr64 _KSCB
         +0x3b8 ThreadTimerDelay : Uint4B
         +0x3bc ThreadFlags3     : Int4B
         +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
         +0x3bc PpmPolicy        : Pos 8, 2 Bits
         +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
         +0x3c0 TracingPrivate   : [1] Uint8B
         +0x3c8 SchedulerAssist  : Ptr64 Void
         +0x3d0 AbWaitObject     : Ptr64 Void
         +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
         +0x3e0 KernelWaitTime   : Uint8B
         +0x3e8 UserWaitTime     : Uint8B
         +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
         +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
         +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
         +0x400 SchedulerAssistPriorityFloor : Int4B
         +0x404 Spare28          : Uint4B
         +0x408 ResourceIndex    : UChar
         +0x409 Spare31          : [3] UChar
         +0x410 EndPadding       : [4] Uint8B
      +0x020 NestingLevel     : UChar
      +0x021 ClockOwner       : UChar
      +0x022 PendingTickFlags : UChar
      +0x022 PendingTick      : Pos 0, 1 Bit
      +0x022 PendingBackupTick : Pos 1, 1 Bit
      +0x023 IdleState        : UChar
      +0x024 Number           : Uint4B
      +0x028 RspBase          : Uint8B
      +0x030 PrcbLock         : Uint8B
      +0x038 PriorityState    : Ptr64 Char
      +0x040 CpuType          : Char
      +0x041 CpuID            : Char
      +0x042 CpuStep          : Uint2B
      +0x042 CpuStepping      : UChar
      +0x043 CpuModel         : UChar
      +0x044 MHz              : Uint4B
      +0x048 HalReserved      : [8] Uint8B
      +0x088 MinorVersion     : Uint2B
      +0x08a MajorVersion     : Uint2B
      +0x08c BuildType        : UChar
      +0x08d CpuVendor        : UChar
      +0x08e LegacyCoresPerPhysicalProcessor : UChar
      +0x08f LegacyLogicalProcessorsPerCore : UChar
      +0x090 TscFrequency     : Uint8B
      +0x098 CoresPerPhysicalProcessor : Uint4B
      +0x09c LogicalProcessorsPerCore : Uint4B
      +0x0a0 PrcbPad04        : [4] Uint8B
      +0x0c0 ParentNode       : Ptr64 _KNODE
         +0x000 IdleNonParkedCpuSet : Uint8B
         +0x008 IdleSmtSet       : Uint8B
         +0x010 NonPairedSmtSet  : Uint8B
         +0x018 IdleCpuSet       : Uint8B
         +0x040 DeepIdleSet      : Uint8B
         +0x048 IdleConstrainedSet : Uint8B
         +0x050 NonParkedSet     : Uint8B
         +0x058 SoftParkedSet    : Uint8B
         +0x060 NonIsrTargetedSet : Uint8B
         +0x068 ParkLock         : Int4B
         +0x06c ThreadSeed       : Uint2B
         +0x06e ProcessSeed      : Uint2B
         +0x080 SiblingMask      : Uint4B
         +0x088 Affinity         : _GROUP_AFFINITY
         +0x088 AffinityFill     : [10] UChar
         +0x092 NodeNumber       : Uint2B
         +0x094 PrimaryNodeNumber : Uint2B
         +0x096 Spare0           : Uint2B
         +0x098 SharedReadyQueueMask : Uint8B
         +0x0a0 StrideMask       : Uint8B
         +0x0a8 ProximityId      : Uint4B
         +0x0ac Lowest           : Uint4B
         +0x0b0 Highest          : Uint4B
         +0x0b4 MaximumProcessors : UChar
         +0x0b5 Flags            : _flags
         +0x0b6 Spare10          : UChar
         +0x0b8 HeteroSets       : [5] _KHETERO_PROCESSOR_SET
         +0x130 PpmConfiguredQosSets : [5] Uint8B
         +0x158 Spare11          : Uint8B
         +0x160 QosGroupingSets  : _KQOS_GROUPING_SETS
         +0x170 QosPreemptibleSet : Uint8B
         +0x178 LLCLeaders       : Uint8B
      +0x0c8 GroupSetMember   : Uint8B
      +0x0d0 Group            : UChar
      +0x0d1 GroupIndex       : UChar
      +0x0d2 PrcbPad05        : [2] UChar
      +0x0d4 InitialApicId    : Uint4B
      +0x0d8 ScbOffset        : Uint4B
      +0x0dc ApicMask         : Uint4B
      +0x0e0 AcpiReserved     : Ptr64 Void
      +0x0e8 CFlushSize       : Uint4B
      +0x0ec PrcbFlags        : _KPRCBFLAG
         +0x000 PrcbFlags        : Int4B
         +0x000 BamQosLevel      : Pos 0, 8 Bits
         +0x000 PendingQosUpdate : Pos 8, 2 Bits
         +0x000 CacheIsolationEnabled : Pos 10, 1 Bit
         +0x000 TracepointActive : Pos 11, 1 Bit
         +0x000 PrcbFlagsReserved : Pos 12, 20 Bits
      +0x0f0 PrcbPad11        : [2] Uint8B
      +0x100 ProcessorState   : _KPROCESSOR_STATE
         +0x000 SpecialRegisters : _KSPECIAL_REGISTERS
         +0x0f0 ContextFrame     : _CONTEXT
      +0x6c0 ExtendedSupervisorState : Ptr64 _XSAVE_AREA_HEADER
         +0x000 Mask             : Uint8B
         +0x008 CompactionMask   : Uint8B
         +0x010 Reserved2        : [6] Uint8B
      +0x6c8 ProcessorSignature : Uint4B
      +0x6cc ProcessorFlags   : Uint4B
      +0x6d0 BpbRetpolineExitSpecCtrl : Uint2B
      +0x6d2 BpbTrappedRetpolineExitSpecCtrl : Uint2B
      +0x6d4 BpbTrappedBpbState : Uint2B
      +0x6d4 BpbTrappedCpuIdle : Pos 0, 1 Bit
      +0x6d4 BpbTrappedFlushRsbOnTrap : Pos 1, 1 Bit
      +0x6d4 BpbTrappedIbpbOnReturn : Pos 2, 1 Bit
      +0x6d4 BpbTrappedIbpbOnTrap : Pos 3, 1 Bit
      +0x6d4 BpbTrappedIbpbOnRetpolineExit : Pos 4, 1 Bit
      +0x6d4 BpbTrappedFlushRsbOnReturn : Pos 5, 1 Bit
      +0x6d4 BpbTrappedFlushRsbOnRetpolineExit : Pos 6, 1 Bit
      +0x6d4 BpbTrappedBpbStateReserved : Pos 7, 1 Bit
      +0x6d4 BpbTrappedBpbStateReserved2 : Pos 8, 8 Bits
      +0x6d6 BpbRetpolineState : UChar
      +0x6d6 BpbRunningNonRetpolineCode : Pos 0, 1 Bit
      +0x6d6 BpbIndirectCallsSafe : Pos 1, 1 Bit
      +0x6d6 BpbRetpolineEnabled : Pos 2, 1 Bit
      +0x6d6 BpbRetpolineStateReserved : Pos 3, 5 Bits
      +0x6d7 PrcbPad12b       : UChar
      +0x6d0 PrcbPad12a       : Uint8B
      +0x6d8 TrappedSecurityDomain : Uint8B
      +0x6e0 BpbState         : Uint2B
      +0x6e0 BpbCpuIdle       : Pos 0, 1 Bit
      +0x6e0 BpbFlushRsbOnTrap : Pos 1, 1 Bit
      +0x6e0 BpbIbpbOnReturn  : Pos 2, 1 Bit
      +0x6e0 BpbIbpbOnTrap    : Pos 3, 1 Bit
      +0x6e0 BpbIbpbOnRetpolineExit : Pos 4, 1 Bit
      +0x6e0 BpbFlushRsbOnReturn : Pos 5, 1 Bit
      +0x6e0 BpbFlushRsbOnRetpolineExit : Pos 6, 1 Bit
      +0x6e0 BpbDivideOnReturn : Pos 7, 1 Bit
      +0x6e0 VerwOnNonKvaReturn : Pos 8, 1 Bit
      +0x6e0 FlushBhbOnTrap   : Pos 9, 1 Bit
      +0x6e0 Spare            : Pos 10, 6 Bits
      +0x6e2 BpbFeatures      : UChar
      +0x6e2 BpbClearOnIdle   : Pos 0, 1 Bit
      +0x6e2 BpbEnabled       : Pos 1, 1 Bit
      +0x6e2 BpbSmep          : Pos 2, 1 Bit
      +0x6e2 BpbKCet          : Pos 3, 1 Bit
      +0x6e2 BhbFlushSequence : Pos 4, 2 Bits
      +0x6e2 BpbFeaturesReserved : Pos 6, 2 Bits
      +0x6e3 PrcbPad12e       : [1] UChar
      +0x6e4 BpbCurrentSpecCtrl : Uint2B
      +0x6e6 BpbKernelSpecCtrl : Uint2B
      +0x6e8 BpbNmiSpecCtrl   : Uint2B
      +0x6ea BpbUserSpecCtrl  : Uint2B
      +0x6ec PairRegister     : Int2B
      +0x6ee PrcbPad12d       : [2] UChar
      +0x6d8 PrcbPad12c       : [3] Uint8B
      +0x6f0 LockQueue        : [17] _KSPIN_LOCK_QUEUE
         +0x000 Next             : Ptr64 _KSPIN_LOCK_QUEUE
         +0x008 Lock             : Ptr64 Uint8B
      +0x800 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
         +0x000 P                : Ptr64 _GENERAL_LOOKASIDE
         +0x008 L                : Ptr64 _GENERAL_LOOKASIDE
      +0x900 PPNxPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
         +0x000 ListHead         : _SLIST_HEADER
         +0x000 SingleListHead   : _SINGLE_LIST_ENTRY
         +0x010 Depth            : Uint2B
         +0x012 MaximumDepth     : Uint2B
         +0x014 TotalAllocates   : Uint4B
         +0x018 AllocateMisses   : Uint4B
         +0x018 AllocateHits     : Uint4B
         +0x01c TotalFrees       : Uint4B
         +0x020 FreeMisses       : Uint4B
         +0x020 FreeHits         : Uint4B
         +0x024 Type             : _POOL_TYPE
         +0x028 Tag              : Uint4B
         +0x02c Size             : Uint4B
         +0x030 AllocateEx       : Ptr64           void* 
         +0x030 Allocate         : Ptr64           void* 
         +0x038 FreeEx           : Ptr64           void 
         +0x038 Free             : Ptr64           void 
         +0x040 ListEntry        : _LIST_ENTRY
         +0x050 LastTotalAllocates : Uint4B
         +0x054 LastAllocateMisses : Uint4B
         +0x054 LastAllocateHits : Uint4B
         +0x058 Future           : [2] Uint4B
      +0x1500 PPNPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
         +0x000 ListHead         : _SLIST_HEADER
         +0x000 SingleListHead   : _SINGLE_LIST_ENTRY
         +0x010 Depth            : Uint2B
         +0x012 MaximumDepth     : Uint2B
         +0x014 TotalAllocates   : Uint4B
         +0x018 AllocateMisses   : Uint4B
         +0x018 AllocateHits     : Uint4B
         +0x01c TotalFrees       : Uint4B
         +0x020 FreeMisses       : Uint4B
         +0x020 FreeHits         : Uint4B
         +0x024 Type             : _POOL_TYPE
         +0x028 Tag              : Uint4B
         +0x02c Size             : Uint4B
         +0x030 AllocateEx       : Ptr64           void* 
         +0x030 Allocate         : Ptr64           void* 
         +0x038 FreeEx           : Ptr64           void 
         +0x038 Free             : Ptr64           void 
         +0x040 ListEntry        : _LIST_ENTRY
         +0x050 LastTotalAllocates : Uint4B
         +0x054 LastAllocateMisses : Uint4B
         +0x054 LastAllocateHits : Uint4B
         +0x058 Future           : [2] Uint4B
      +0x2100 PPPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
         +0x000 ListHead         : _SLIST_HEADER
         +0x000 SingleListHead   : _SINGLE_LIST_ENTRY
         +0x010 Depth            : Uint2B
         +0x012 MaximumDepth     : Uint2B
         +0x014 TotalAllocates   : Uint4B
         +0x018 AllocateMisses   : Uint4B
         +0x018 AllocateHits     : Uint4B
         +0x01c TotalFrees       : Uint4B
         +0x020 FreeMisses       : Uint4B
         +0x020 FreeHits         : Uint4B
         +0x024 Type             : _POOL_TYPE
         +0x028 Tag              : Uint4B
         +0x02c Size             : Uint4B
         +0x030 AllocateEx       : Ptr64           void* 
         +0x030 Allocate         : Ptr64           void* 
         +0x038 FreeEx           : Ptr64           void 
         +0x038 Free             : Ptr64           void 
         +0x040 ListEntry        : _LIST_ENTRY
         +0x050 LastTotalAllocates : Uint4B
         +0x054 LastAllocateMisses : Uint4B
         +0x054 LastAllocateHits : Uint4B
         +0x058 Future           : [2] Uint4B
      +0x2d00 MsrIa32TsxCtrl   : Uint8B
      +0x2d08 DeferredReadyListHead : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
      +0x2d10 MmPageFaultCount : Int4B
      +0x2d14 MmCopyOnWriteCount : Int4B
      +0x2d18 MmTransitionCount : Int4B
      +0x2d1c MmDemandZeroCount : Int4B
      +0x2d20 MmPageReadCount  : Int4B
      +0x2d24 MmPageReadIoCount : Int4B
      +0x2d28 MmDirtyPagesWriteCount : Int4B
      +0x2d2c MmDirtyWriteIoCount : Int4B
      +0x2d30 MmMappedPagesWriteCount : Int4B
      +0x2d34 MmMappedWriteIoCount : Int4B
      +0x2d38 KeSystemCalls    : Uint4B
      +0x2d3c KeContextSwitches : Uint4B
      +0x2d40 PrcbPad40        : Uint4B
      +0x2d44 CcFastReadNoWait : Uint4B
      +0x2d48 CcFastReadWait   : Uint4B
      +0x2d4c CcFastReadNotPossible : Uint4B
      +0x2d50 CcCopyReadNoWait : Uint4B
      +0x2d54 CcCopyReadWait   : Uint4B
      +0x2d58 CcCopyReadNoWaitMiss : Uint4B
      +0x2d5c IoReadOperationCount : Int4B
      +0x2d60 IoWriteOperationCount : Int4B
      +0x2d64 IoOtherOperationCount : Int4B
      +0x2d68 IoReadTransferCount : _LARGE_INTEGER
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
         +0x000 u                : <anonymous-tag>
         +0x000 QuadPart         : Int8B
      +0x2d70 IoWriteTransferCount : _LARGE_INTEGER
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
         +0x000 u                : <anonymous-tag>
         +0x000 QuadPart         : Int8B
      +0x2d78 IoOtherTransferCount : _LARGE_INTEGER
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
         +0x000 u                : <anonymous-tag>
         +0x000 QuadPart         : Int8B
      +0x2d80 PacketBarrier    : Int4B
      +0x2d84 TargetCount      : Int4B
      +0x2d88 IpiFrozen        : Uint4B
      +0x2d8c PrcbPad30        : Uint4B
      +0x2d90 IsrDpcStats      : Ptr64 Void
      +0x2d98 DeviceInterrupts : Uint4B
      +0x2d9c LookasideIrpFloat : Int4B
      +0x2da0 InterruptLastCount : Uint4B
      +0x2da4 InterruptRate    : Uint4B
      +0x2da8 PrcbPad31        : Uint8B
      +0x2db0 PairPrcb         : Ptr64 _KPRCB
         +0x000 MxCsr            : Uint4B
         +0x004 LegacyNumber     : UChar
         +0x005 ReservedMustBeZero : UChar
         +0x006 InterruptRequest : UChar
         +0x007 IdleHalt         : UChar
         +0x008 CurrentThread    : Ptr64 _KTHREAD
         +0x010 NextThread       : Ptr64 _KTHREAD
         +0x018 IdleThread       : Ptr64 _KTHREAD
         +0x020 NestingLevel     : UChar
         +0x021 ClockOwner       : UChar
         +0x022 PendingTickFlags : UChar
         +0x022 PendingTick      : Pos 0, 1 Bit
         +0x022 PendingBackupTick : Pos 1, 1 Bit
         +0x023 IdleState        : UChar
         +0x024 Number           : Uint4B
         +0x028 RspBase          : Uint8B
         +0x030 PrcbLock         : Uint8B
         +0x038 PriorityState    : Ptr64 Char
         +0x040 CpuType          : Char
         +0x041 CpuID            : Char
         +0x042 CpuStep          : Uint2B
         +0x042 CpuStepping      : UChar
         +0x043 CpuModel         : UChar
         +0x044 MHz              : Uint4B
         +0x048 HalReserved      : [8] Uint8B
         +0x088 MinorVersion     : Uint2B
         +0x08a MajorVersion     : Uint2B
         +0x08c BuildType        : UChar
         +0x08d CpuVendor        : UChar
         +0x08e LegacyCoresPerPhysicalProcessor : UChar
         +0x08f LegacyLogicalProcessorsPerCore : UChar
         +0x090 TscFrequency     : Uint8B
         +0x098 CoresPerPhysicalProcessor : Uint4B
         +0x09c LogicalProcessorsPerCore : Uint4B
         +0x0a0 PrcbPad04        : [4] Uint8B
         +0x0c0 ParentNode       : Ptr64 _KNODE
         +0x0c8 GroupSetMember   : Uint8B
         +0x0d0 Group            : UChar
         +0x0d1 GroupIndex       : UChar
         +0x0d2 PrcbPad05        : [2] UChar
         +0x0d4 InitialApicId    : Uint4B
         +0x0d8 ScbOffset        : Uint4B
         +0x0dc ApicMask         : Uint4B
         +0x0e0 AcpiReserved     : Ptr64 Void
         +0x0e8 CFlushSize       : Uint4B
         +0x0ec PrcbFlags        : _KPRCBFLAG
         +0x0f0 PrcbPad11        : [2] Uint8B
         +0x100 ProcessorState   : _KPROCESSOR_STATE
         +0x6c0 ExtendedSupervisorState : Ptr64 _XSAVE_AREA_HEADER
         +0x6c8 ProcessorSignature : Uint4B
         +0x6cc ProcessorFlags   : Uint4B
         +0x6d0 BpbRetpolineExitSpecCtrl : Uint2B
         +0x6d2 BpbTrappedRetpolineExitSpecCtrl : Uint2B
         +0x6d4 BpbTrappedBpbState : Uint2B
         +0x6d4 BpbTrappedCpuIdle : Pos 0, 1 Bit
         +0x6d4 BpbTrappedFlushRsbOnTrap : Pos 1, 1 Bit
         +0x6d4 BpbTrappedIbpbOnReturn : Pos 2, 1 Bit
         +0x6d4 BpbTrappedIbpbOnTrap : Pos 3, 1 Bit
         +0x6d4 BpbTrappedIbpbOnRetpolineExit : Pos 4, 1 Bit
         +0x6d4 BpbTrappedFlushRsbOnReturn : Pos 5, 1 Bit
         +0x6d4 BpbTrappedFlushRsbOnRetpolineExit : Pos 6, 1 Bit
         +0x6d4 BpbTrappedBpbStateReserved : Pos 7, 1 Bit
         +0x6d4 BpbTrappedBpbStateReserved2 : Pos 8, 8 Bits
         +0x6d6 BpbRetpolineState : UChar
         +0x6d6 BpbRunningNonRetpolineCode : Pos 0, 1 Bit
         +0x6d6 BpbIndirectCallsSafe : Pos 1, 1 Bit
         +0x6d6 BpbRetpolineEnabled : Pos 2, 1 Bit
         +0x6d6 BpbRetpolineStateReserved : Pos 3, 5 Bits
         +0x6d7 PrcbPad12b       : UChar
         +0x6d0 PrcbPad12a       : Uint8B
         +0x6d8 TrappedSecurityDomain : Uint8B
         +0x6e0 BpbState         : Uint2B
         +0x6e0 BpbCpuIdle       : Pos 0, 1 Bit
         +0x6e0 BpbFlushRsbOnTrap : Pos 1, 1 Bit
         +0x6e0 BpbIbpbOnReturn  : Pos 2, 1 Bit
         +0x6e0 BpbIbpbOnTrap    : Pos 3, 1 Bit
         +0x6e0 BpbIbpbOnRetpolineExit : Pos 4, 1 Bit
         +0x6e0 BpbFlushRsbOnReturn : Pos 5, 1 Bit
         +0x6e0 BpbFlushRsbOnRetpolineExit : Pos 6, 1 Bit
         +0x6e0 BpbDivideOnReturn : Pos 7, 1 Bit
         +0x6e0 VerwOnNonKvaReturn : Pos 8, 1 Bit
         +0x6e0 FlushBhbOnTrap   : Pos 9, 1 Bit
         +0x6e0 Spare            : Pos 10, 6 Bits
         +0x6e2 BpbFeatures      : UChar
         +0x6e2 BpbClearOnIdle   : Pos 0, 1 Bit
         +0x6e2 BpbEnabled       : Pos 1, 1 Bit
         +0x6e2 BpbSmep          : Pos 2, 1 Bit
         +0x6e2 BpbKCet          : Pos 3, 1 Bit
         +0x6e2 BhbFlushSequence : Pos 4, 2 Bits
         +0x6e2 BpbFeaturesReserved : Pos 6, 2 Bits
         +0x6e3 PrcbPad12e       : [1] UChar
         +0x6e4 BpbCurrentSpecCtrl : Uint2B
         +0x6e6 BpbKernelSpecCtrl : Uint2B
         +0x6e8 BpbNmiSpecCtrl   : Uint2B
         +0x6ea BpbUserSpecCtrl  : Uint2B
         +0x6ec PairRegister     : Int2B
         +0x6ee PrcbPad12d       : [2] UChar
         +0x6d8 PrcbPad12c       : [3] Uint8B
         +0x6f0 LockQueue        : [17] _KSPIN_LOCK_QUEUE
         +0x800 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
         +0x900 PPNxPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
         +0x1500 PPNPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
         +0x2100 PPPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
         +0x2d00 MsrIa32TsxCtrl   : Uint8B
         +0x2d08 DeferredReadyListHead : _SINGLE_LIST_ENTRY
         +0x2d10 MmPageFaultCount : Int4B
         +0x2d14 MmCopyOnWriteCount : Int4B
         +0x2d18 MmTransitionCount : Int4B
         +0x2d1c MmDemandZeroCount : Int4B
         +0x2d20 MmPageReadCount  : Int4B
         +0x2d24 MmPageReadIoCount : Int4B
         +0x2d28 MmDirtyPagesWriteCount : Int4B
         +0x2d2c MmDirtyWriteIoCount : Int4B
         +0x2d30 MmMappedPagesWriteCount : Int4B
         +0x2d34 MmMappedWriteIoCount : Int4B
         +0x2d38 KeSystemCalls    : Uint4B
         +0x2d3c KeContextSwitches : Uint4B
         +0x2d40 PrcbPad40        : Uint4B
         +0x2d44 CcFastReadNoWait : Uint4B
         +0x2d48 CcFastReadWait   : Uint4B
         +0x2d4c CcFastReadNotPossible : Uint4B
         +0x2d50 CcCopyReadNoWait : Uint4B
         +0x2d54 CcCopyReadWait   : Uint4B
         +0x2d58 CcCopyReadNoWaitMiss : Uint4B
         +0x2d5c IoReadOperationCount : Int4B
         +0x2d60 IoWriteOperationCount : Int4B
         +0x2d64 IoOtherOperationCount : Int4B
         +0x2d68 IoReadTransferCount : _LARGE_INTEGER
         +0x2d70 IoWriteTransferCount : _LARGE_INTEGER
         +0x2d78 IoOtherTransferCount : _LARGE_INTEGER
         +0x2d80 PacketBarrier    : Int4B
         +0x2d84 TargetCount      : Int4B
         +0x2d88 IpiFrozen        : Uint4B
         +0x2d8c PrcbPad30        : Uint4B
         +0x2d90 IsrDpcStats      : Ptr64 Void
         +0x2d98 DeviceInterrupts : Uint4B
         +0x2d9c LookasideIrpFloat : Int4B
         +0x2da0 InterruptLastCount : Uint4B
         +0x2da4 InterruptRate    : Uint4B
         +0x2da8 PrcbPad31        : Uint8B
         +0x2db0 PairPrcb         : Ptr64 _KPRCB
         +0x2db8 StaticAffinity   : _KSTATIC_AFFINITY_BLOCK
         +0x3058 PrcbPad35        : [5] Uint8B
         +0x3080 InterruptObjectPool : _SLIST_HEADER
         +0x3090 DpcRuntimeHistoryHashTable : Ptr64 _RTL_HASH_TABLE
         +0x3098 DpcRuntimeHistoryHashTableCleanupDpc : Ptr64 _KDPC
         +0x30a0 CurrentDpcRoutine : Ptr64           void 
         +0x30a8 CurrentDpcRuntimeHistoryCached : Uint8B
         +0x30b0 CurrentDpcStartTime : Uint8B
         +0x30b8 PrcbPad41        : [1] Uint8B
         +0x30c0 DpcData          : [2] _KDPC_DATA
         +0x3110 DpcStack         : Ptr64 Void
         +0x3118 MaximumDpcQueueDepth : Int4B
         +0x311c DpcRequestRate   : Uint4B
         +0x3120 MinimumDpcRate   : Uint4B
         +0x3124 DpcLastCount     : Uint4B
         +0x3128 ThreadDpcEnable  : UChar
         +0x3129 QuantumEnd       : UChar
         +0x312a DpcRoutineActive : UChar
         +0x312b IdleSchedule     : UChar
         +0x312c DpcRequestSummary : Int4B
         +0x312c DpcRequestSlot   : [2] Int2B
         +0x312c NormalDpcState   : Int2B
         +0x312e ThreadDpcState   : Int2B
         +0x312c DpcNormalProcessingActive : Pos 0, 1 Bit
         +0x312c DpcNormalProcessingRequested : Pos 1, 1 Bit
         +0x312c DpcNormalThreadSignal : Pos 2, 1 Bit
         +0x312c DpcNormalTimerExpiration : Pos 3, 1 Bit
         +0x312c DpcNormalDpcPresent : Pos 4, 1 Bit
         +0x312c DpcNormalLocalInterrupt : Pos 5, 1 Bit
         +0x312c DpcNormalSpare   : Pos 6, 10 Bits
         +0x312c DpcThreadActive  : Pos 16, 1 Bit
         +0x312c DpcThreadRequested : Pos 17, 1 Bit
         +0x312c DpcThreadSpare   : Pos 18, 14 Bits
         +0x3130 PrcbPad93        : Uint4B
         +0x3134 LastTick         : Uint4B
         +0x3138 ClockInterrupts  : Uint4B
         +0x313c ReadyScanTick    : Uint4B
         +0x3140 InterruptObject  : [256] Ptr64 Void
         +0x3940 TimerTable       : _KTIMER_TABLE
         +0x7b58 PrcbPad92        : [10] Uint4B
         +0x7b80 DpcGate          : _KGATE
         +0x7b98 PrcbPad52        : Ptr64 Void
         +0x7ba0 CallDpc          : _KDPC
         +0x7be0 ClockKeepAlive   : Int4B
         +0x7be4 PrcbPad60        : [2] UChar
         +0x7be6 NmiActive        : UChar
         +0x7be7 MceActive        : UChar
         +0x7be6 CombinedNmiMceActive : Uint2B
         +0x7be8 DpcWatchdogPeriod : Int4B
         +0x7bec DpcWatchdogCount : Int4B
         +0x7bf0 KeSpinLockOrdering : Int4B
         +0x7bf4 DpcWatchdogProfileCumulativeDpcThreshold : Uint4B
         +0x7bf8 CachedPtes       : Ptr64 Void
         +0x7c00 WaitListHead     : _LIST_ENTRY
         +0x7c10 WaitLock         : Uint8B
         +0x7c18 ReadySummary     : Uint4B
         +0x7c1c AffinitizedSelectionMask : Int4B
         +0x7c20 QueueIndex       : Uint4B
         +0x7c24 PrcbPad75        : [2] Uint4B
         +0x7c2c DpcWatchdogSequenceNumber : Uint4B
         +0x7c30 TimerExpirationDpc : _KDPC
         +0x7c70 ScbQueue         : _RTL_RB_TREE
         +0x7c80 DispatcherReadyListHead : [32] _LIST_ENTRY
         +0x7e80 InterruptCount   : Uint4B
         +0x7e84 KernelTime       : Uint4B
         +0x7e88 UserTime         : Uint4B
         +0x7e8c DpcTime          : Uint4B
         +0x7e90 InterruptTime    : Uint4B
         +0x7e94 AdjustDpcThreshold : Uint4B
         +0x7e98 DebuggerSavedIRQL : UChar
         +0x7e99 GroupSchedulingOverQuota : UChar
         +0x7e9a DeepSleep        : UChar
         +0x7e9b PrcbPad80        : UChar
         +0x7e9c DpcTimeCount     : Uint4B
         +0x7ea0 DpcTimeLimit     : Uint4B
         +0x7ea4 PeriodicCount    : Uint4B
         +0x7ea8 PeriodicBias     : Uint4B
         +0x7eac AvailableTime    : Uint4B
         +0x7eb0 KeExceptionDispatchCount : Uint4B
         +0x7eb4 ReadyThreadCount : Uint4B
         +0x7eb8 ReadyQueueExpectedRunTime : Uint8B
         +0x7ec0 StartCycles      : Uint8B
         +0x7ec8 TaggedCyclesStart : Uint8B
         +0x7ed0 TaggedCycles     : [3] Uint8B
         +0x7ee8 AffinitizedCycles : Uint8B
         +0x7ef0 ImportantCycles  : Uint8B
         +0x7ef8 UnimportantCycles : Uint8B
         +0x7f00 DpcWatchdogProfileSingleDpcThreshold : Uint4B
         +0x7f04 MmSpinLockOrdering : Int4B
         +0x7f08 CachedStack      : Ptr64 Void
         +0x7f10 PageColor        : Uint4B
         +0x7f14 NodeColor        : Uint4B
         +0x7f18 NodeShiftedColor : Uint4B
         +0x7f1c SecondaryColorMask : Uint4B
         +0x7f20 PrcbPad81        : [6] UChar
         +0x7f26 ExceptionStackActive : UChar
         +0x7f27 TbFlushListActive : UChar
         +0x7f28 ExceptionStack   : Ptr64 Void
         +0x7f30 PrcbPad82        : [1] Uint8B
         +0x7f38 CycleTime        : Uint8B
         +0x7f40 Cycles           : [4] [2] Uint8B
         +0x7f80 CcFastMdlReadNoWait : Uint4B
         +0x7f84 CcFastMdlReadWait : Uint4B
         +0x7f88 CcFastMdlReadNotPossible : Uint4B
         +0x7f8c CcMapDataNoWait  : Uint4B
         +0x7f90 CcMapDataWait    : Uint4B
         +0x7f94 CcPinMappedDataCount : Uint4B
         +0x7f98 CcPinReadNoWait  : Uint4B
         +0x7f9c CcPinReadWait    : Uint4B
         +0x7fa0 CcMdlReadNoWait  : Uint4B
         +0x7fa4 CcMdlReadWait    : Uint4B
         +0x7fa8 CcLazyWriteHotSpots : Uint4B
         +0x7fac CcLazyWriteIos   : Uint4B
         +0x7fb0 CcLazyWritePages : Uint4B
         +0x7fb4 CcDataFlushes    : Uint4B
         +0x7fb8 CcDataPages      : Uint4B
         +0x7fbc CcLostDelayedWrites : Uint4B
         +0x7fc0 CcFastReadResourceMiss : Uint4B
         +0x7fc4 CcCopyReadWaitMiss : Uint4B
         +0x7fc8 CcFastMdlReadResourceMiss : Uint4B
         +0x7fcc CcMapDataNoWaitMiss : Uint4B
         +0x7fd0 CcMapDataWaitMiss : Uint4B
         +0x7fd4 CcPinReadNoWaitMiss : Uint4B
         +0x7fd8 CcPinReadWaitMiss : Uint4B
         +0x7fdc CcMdlReadNoWaitMiss : Uint4B
         +0x7fe0 CcMdlReadWaitMiss : Uint4B
         +0x7fe4 CcReadAheadIos   : Uint4B
         +0x7fe8 MmCacheTransitionCount : Int4B
         +0x7fec MmCacheReadCount : Int4B
         +0x7ff0 MmCacheIoCount   : Int4B
         +0x7ff4 PrcbPad91        : Uint4B
         +0x7ff8 MmInternal       : Ptr64 Void
         +0x8000 PowerState       : _PROCESSOR_POWER_STATE
         +0x8200 HyperPte         : Ptr64 Void
         +0x8208 ScbList          : _LIST_ENTRY
         +0x8218 ForceIdleDpc     : _KDPC
         +0x8258 DpcWatchdogDpc   : _KDPC
         +0x8298 DpcWatchdogTimer : _KTIMER
         +0x82d8 Cache            : [5] _CACHE_DESCRIPTOR
         +0x8314 CacheCount       : Uint4B
         +0x8318 CachedCommit     : Uint4B
         +0x831c CachedResidentAvailable : Uint4B
         +0x8320 WheaInfo         : Ptr64 Void
         +0x8328 EtwSupport       : Ptr64 Void
         +0x8330 ExSaPageArray    : Ptr64 Void
         +0x8338 KeAlignmentFixupCount : Uint4B
         +0x833c PrcbPad95        : Uint4B
         +0x8340 HypercallPageList : _SLIST_HEADER
         +0x8350 StatisticsPage   : Ptr64 Uint8B
         +0x8358 GenerationTarget : Uint8B
         +0x8360 PrcbPad85        : [4] Uint8B
         +0x8380 HypercallCachedPages : Ptr64 Void
         +0x8388 VirtualApicAssist : Ptr64 Void
         +0x8390 PackageProcessorSet : _KAFFINITY_EX
         +0x8438 PackageId        : Uint4B
         +0x843c PrcbPad86        : Uint4B
         +0x8440 SharedReadyQueueMask : Uint8B
         +0x8448 SharedReadyQueue : Ptr64 _KSHARED_READY_QUEUE
         +0x8450 SharedQueueScanOwner : Uint4B
         +0x8454 ScanSiblingIndex : Uint4B
         +0x8458 CoreProcessorSet : Uint8B
         +0x8460 ScanSiblingMask  : Uint8B
         +0x8468 LLCMask          : Uint8B
         +0x8470 CacheProcessorMask : [5] Uint8B
         +0x8498 ProcessorProfileControlArea : Ptr64 _PROCESSOR_PROFILE_CONTROL_AREA
         +0x84a0 ProfileEventIndexAddress : Ptr64 Void
         +0x84a8 DpcWatchdogProfile : Ptr64 Ptr64 Void
         +0x84b0 DpcWatchdogProfileCurrentEmptyCapture : Ptr64 Ptr64 Void
         +0x84b8 SchedulerAssist  : Ptr64 Void
         +0x84c0 SynchCounters    : _SYNCH_COUNTERS
         +0x8578 PrcbPad94        : Uint8B
         +0x8580 FsCounters       : _FILESYSTEM_DISK_COUNTERS
         +0x8590 VendorString     : [13] UChar
         +0x859d PrcbPad100       : [3] UChar
         +0x85a0 FeatureBits      : Uint8B
         +0x85a8 UpdateSignature  : _LARGE_INTEGER
         +0x85b0 PteBitCache      : Uint8B
         +0x85b8 PteBitOffset     : Uint4B
         +0x85bc PrcbPad105       : Uint4B
         +0x85c0 Context          : Ptr64 _CONTEXT
         +0x85c8 ContextFlagsInit : Uint4B
         +0x85cc PrcbPad115       : Uint4B
         +0x85d0 ExtendedState    : Ptr64 _XSAVE_AREA
         +0x85d8 IsrStack         : Ptr64 Void
         +0x85e0 EntropyTimingState : _KENTROPY_TIMING_STATE
         +0x8730 PrcbPad110       : Uint8B
         +0x8738 StibpPairingTrace : <anonymous-tag>
         +0x8770 AbSelfIoBoostsList : _SINGLE_LIST_ENTRY
         +0x8778 AbPropagateBoostsList : _SINGLE_LIST_ENTRY
         +0x8780 AbDpc            : _KDPC
         +0x87c0 IoIrpStackProfilerCurrent : _IOP_IRP_STACK_PROFILER
         +0x8814 IoIrpStackProfilerPrevious : _IOP_IRP_STACK_PROFILER
         +0x8868 SecureFault      : _KSECURE_FAULT_INFORMATION
         +0x8878 PrcbPad120       : Uint8B
         +0x8880 LocalSharedReadyQueue : _KSHARED_READY_QUEUE
         +0x8af0 PrcbPad125       : [2] Uint8B
         +0x8b00 TimerExpirationTraceCount : Uint4B
         +0x8b04 PrcbPad127       : Uint4B
         +0x8b08 TimerExpirationTrace : [16] _KTIMER_EXPIRATION_TRACE
         +0x8c08 PrcbPad128       : [7] Uint8B
         +0x8c40 Mailbox          : Ptr64 _REQUEST_MAILBOX
         +0x8c48 PrcbPad130       : [7] Uint8B
         +0x8c80 McheckContext    : [2] _MACHINE_CHECK_CONTEXT
         +0x8d20 PrcbPad134       : [4] Uint8B
         +0x8d40 SelfmapLockHandle : [4] _KLOCK_QUEUE_HANDLE
         +0x8da0 PrcbPad134a      : [4] Uint8B
         +0x8dc0 PrcbPad138       : [128] UChar
         +0x8e40 PrcbPad138a      : [64] UChar
         +0x8e80 KernelDirectoryTableBase : Uint8B
         +0x8e88 RspBaseShadow    : Uint8B
         +0x8e90 UserRspShadow    : Uint8B
         +0x8e98 ShadowFlags      : Uint4B
         +0x8e9c PrcbPad138b      : Uint4B
         +0x8ea0 PrcbPad138c      : Uint8B
         +0x8ea8 PrcbPad138d      : Uint2B
         +0x8eaa VerwSelector     : Uint2B
         +0x8eac DbgMceNestingLevel : Uint4B
         +0x8eb0 DbgMceFlags      : Uint4B
         +0x8eb4 PrcbPad139b      : Uint4B
         +0x8eb8 PrcbPad140       : [505] Uint8B
         +0x9e80 PrcbPad140a      : [8] Uint8B
         +0x9ec0 PrcbPad141       : [504] Uint8B
         +0xae80 PrcbPad141a      : [64] UChar
         +0xaec0 RequestMailbox   : [1] _REQUEST_MAILBOX
      +0x2db8 StaticAffinity   : _KSTATIC_AFFINITY_BLOCK
         +0x000 KeFlushTbAffinity : _KAFFINITY_EX
         +0x000 KeFlushWbAffinity : _KAFFINITY_EX
         +0x000 KeSyncContextAffinity : _KAFFINITY_EX
         +0x0a8 KeFlushTbDeepIdleAffinity : _KAFFINITY_EX
         +0x150 KeIpiSendAffinity : _KAFFINITY_EX
         +0x1f8 KeIpiSendIpiSet  : _KAFFINITY_EX
      +0x3058 PrcbPad35        : [5] Uint8B
      +0x3080 InterruptObjectPool : _SLIST_HEADER
         +0x000 Alignment        : Uint8B
         +0x008 Region           : Uint8B
         +0x000 HeaderX64        : <anonymous-tag>
      +0x3090 DpcRuntimeHistoryHashTable : Ptr64 _RTL_HASH_TABLE
         +0x000 EntryCount       : Uint4B
         +0x004 MaskBitCount     : Pos 0, 5 Bits
         +0x004 BucketCount      : Pos 5, 27 Bits
         +0x008 Buckets          : Ptr64 _SINGLE_LIST_ENTRY
      +0x3098 DpcRuntimeHistoryHashTableCleanupDpc : Ptr64 _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x30a0 CurrentDpcRoutine : Ptr64        void 
      +0x30a8 CurrentDpcRuntimeHistoryCached : Uint8B
      +0x30b0 CurrentDpcStartTime : Uint8B
      +0x30b8 PrcbPad41        : [1] Uint8B
      +0x30c0 DpcData          : [2] _KDPC_DATA
         +0x000 DpcList          : _KDPC_LIST
         +0x010 DpcLock          : Uint8B
         +0x018 DpcQueueDepth    : Int4B
         +0x01c DpcCount         : Uint4B
         +0x020 ActiveDpc        : Ptr64 _KDPC
      +0x3110 DpcStack         : Ptr64 Void
      +0x3118 MaximumDpcQueueDepth : Int4B
      +0x311c DpcRequestRate   : Uint4B
      +0x3120 MinimumDpcRate   : Uint4B
      +0x3124 DpcLastCount     : Uint4B
      +0x3128 ThreadDpcEnable  : UChar
      +0x3129 QuantumEnd       : UChar
      +0x312a DpcRoutineActive : UChar
      +0x312b IdleSchedule     : UChar
      +0x312c DpcRequestSummary : Int4B
      +0x312c DpcRequestSlot   : [2] Int2B
      +0x312c NormalDpcState   : Int2B
      +0x312e ThreadDpcState   : Int2B
      +0x312c DpcNormalProcessingActive : Pos 0, 1 Bit
      +0x312c DpcNormalProcessingRequested : Pos 1, 1 Bit
      +0x312c DpcNormalThreadSignal : Pos 2, 1 Bit
      +0x312c DpcNormalTimerExpiration : Pos 3, 1 Bit
      +0x312c DpcNormalDpcPresent : Pos 4, 1 Bit
      +0x312c DpcNormalLocalInterrupt : Pos 5, 1 Bit
      +0x312c DpcNormalSpare   : Pos 6, 10 Bits
      +0x312c DpcThreadActive  : Pos 16, 1 Bit
      +0x312c DpcThreadRequested : Pos 17, 1 Bit
      +0x312c DpcThreadSpare   : Pos 18, 14 Bits
      +0x3130 PrcbPad93        : Uint4B
      +0x3134 LastTick         : Uint4B
      +0x3138 ClockInterrupts  : Uint4B
      +0x313c ReadyScanTick    : Uint4B
      +0x3140 InterruptObject  : [256] Ptr64 Void
      +0x3940 TimerTable       : _KTIMER_TABLE
         +0x000 TimerExpiry      : [64] Ptr64 _KTIMER
         +0x200 TimerEntries     : [2] [256] _KTIMER_TABLE_ENTRY
         +0x4200 TableState       : _KTIMER_TABLE_STATE
      +0x7b58 PrcbPad92        : [10] Uint4B
      +0x7b80 DpcGate          : _KGATE
         +0x000 Header           : _DISPATCHER_HEADER
      +0x7b98 PrcbPad52        : Ptr64 Void
      +0x7ba0 CallDpc          : _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x7be0 ClockKeepAlive   : Int4B
      +0x7be4 PrcbPad60        : [2] UChar
      +0x7be6 NmiActive        : UChar
      +0x7be7 MceActive        : UChar
      +0x7be6 CombinedNmiMceActive : Uint2B
      +0x7be8 DpcWatchdogPeriod : Int4B
      +0x7bec DpcWatchdogCount : Int4B
      +0x7bf0 KeSpinLockOrdering : Int4B
      +0x7bf4 DpcWatchdogProfileCumulativeDpcThreshold : Uint4B
      +0x7bf8 CachedPtes       : Ptr64 Void
      +0x7c00 WaitListHead     : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x7c10 WaitLock         : Uint8B
      +0x7c18 ReadySummary     : Uint4B
      +0x7c1c AffinitizedSelectionMask : Int4B
      +0x7c20 QueueIndex       : Uint4B
      +0x7c24 PrcbPad75        : [2] Uint4B
      +0x7c2c DpcWatchdogSequenceNumber : Uint4B
      +0x7c30 TimerExpirationDpc : _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x7c70 ScbQueue         : _RTL_RB_TREE
         +0x000 Root             : Ptr64 _RTL_BALANCED_NODE
         +0x008 Encoded          : Pos 0, 1 Bit
         +0x008 Min              : Ptr64 _RTL_BALANCED_NODE
      +0x7c80 DispatcherReadyListHead : [32] _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x7e80 InterruptCount   : Uint4B
      +0x7e84 KernelTime       : Uint4B
      +0x7e88 UserTime         : Uint4B
      +0x7e8c DpcTime          : Uint4B
      +0x7e90 InterruptTime    : Uint4B
      +0x7e94 AdjustDpcThreshold : Uint4B
      +0x7e98 DebuggerSavedIRQL : UChar
      +0x7e99 GroupSchedulingOverQuota : UChar
      +0x7e9a DeepSleep        : UChar
      +0x7e9b PrcbPad80        : UChar
      +0x7e9c DpcTimeCount     : Uint4B
      +0x7ea0 DpcTimeLimit     : Uint4B
      +0x7ea4 PeriodicCount    : Uint4B
      +0x7ea8 PeriodicBias     : Uint4B
      +0x7eac AvailableTime    : Uint4B
      +0x7eb0 KeExceptionDispatchCount : Uint4B
      +0x7eb4 ReadyThreadCount : Uint4B
      +0x7eb8 ReadyQueueExpectedRunTime : Uint8B
      +0x7ec0 StartCycles      : Uint8B
      +0x7ec8 TaggedCyclesStart : Uint8B
      +0x7ed0 TaggedCycles     : [3] Uint8B
      +0x7ee8 AffinitizedCycles : Uint8B
      +0x7ef0 ImportantCycles  : Uint8B
      +0x7ef8 UnimportantCycles : Uint8B
      +0x7f00 DpcWatchdogProfileSingleDpcThreshold : Uint4B
      +0x7f04 MmSpinLockOrdering : Int4B
      +0x7f08 CachedStack      : Ptr64 Void
      +0x7f10 PageColor        : Uint4B
      +0x7f14 NodeColor        : Uint4B
      +0x7f18 NodeShiftedColor : Uint4B
      +0x7f1c SecondaryColorMask : Uint4B
      +0x7f20 PrcbPad81        : [6] UChar
      +0x7f26 ExceptionStackActive : UChar
      +0x7f27 TbFlushListActive : UChar
      +0x7f28 ExceptionStack   : Ptr64 Void
      +0x7f30 PrcbPad82        : [1] Uint8B
      +0x7f38 CycleTime        : Uint8B
      +0x7f40 Cycles           : [4] [2] Uint8B
      +0x7f80 CcFastMdlReadNoWait : Uint4B
      +0x7f84 CcFastMdlReadWait : Uint4B
      +0x7f88 CcFastMdlReadNotPossible : Uint4B
      +0x7f8c CcMapDataNoWait  : Uint4B
      +0x7f90 CcMapDataWait    : Uint4B
      +0x7f94 CcPinMappedDataCount : Uint4B
      +0x7f98 CcPinReadNoWait  : Uint4B
      +0x7f9c CcPinReadWait    : Uint4B
      +0x7fa0 CcMdlReadNoWait  : Uint4B
      +0x7fa4 CcMdlReadWait    : Uint4B
      +0x7fa8 CcLazyWriteHotSpots : Uint4B
      +0x7fac CcLazyWriteIos   : Uint4B
      +0x7fb0 CcLazyWritePages : Uint4B
      +0x7fb4 CcDataFlushes    : Uint4B
      +0x7fb8 CcDataPages      : Uint4B
      +0x7fbc CcLostDelayedWrites : Uint4B
      +0x7fc0 CcFastReadResourceMiss : Uint4B
      +0x7fc4 CcCopyReadWaitMiss : Uint4B
      +0x7fc8 CcFastMdlReadResourceMiss : Uint4B
      +0x7fcc CcMapDataNoWaitMiss : Uint4B
      +0x7fd0 CcMapDataWaitMiss : Uint4B
      +0x7fd4 CcPinReadNoWaitMiss : Uint4B
      +0x7fd8 CcPinReadWaitMiss : Uint4B
      +0x7fdc CcMdlReadNoWaitMiss : Uint4B
      +0x7fe0 CcMdlReadWaitMiss : Uint4B
      +0x7fe4 CcReadAheadIos   : Uint4B
      +0x7fe8 MmCacheTransitionCount : Int4B
      +0x7fec MmCacheReadCount : Int4B
      +0x7ff0 MmCacheIoCount   : Int4B
      +0x7ff4 PrcbPad91        : Uint4B
      +0x7ff8 MmInternal       : Ptr64 Void
      +0x8000 PowerState       : _PROCESSOR_POWER_STATE
         +0x000 IdleStates       : Ptr64 _PPM_IDLE_STATES
         +0x008 IdleAccounting   : Ptr64 _PROC_IDLE_ACCOUNTING
         +0x010 IdleTimeLast     : Uint8B
         +0x018 IdleTimeTotal    : Uint8B
         +0x020 IdleTimeEntry    : Uint8B
         +0x028 IdleTimeExpiration : Uint8B
         +0x030 NonInterruptibleTransition : UChar
         +0x031 PepWokenTransition : UChar
         +0x032 HvTargetState    : UChar
         +0x033 SoftParked       : UChar
         +0x034 TargetIdleState  : Uint4B
         +0x038 IdlePolicy       : _PROC_IDLE_POLICY
         +0x040 Synchronization  : _PPM_IDLE_SYNCHRONIZATION_STATE
         +0x048 PerfFeedback     : _PROC_FEEDBACK
         +0x0d8 Hypervisor       : _PROC_HYPERVISOR_STATE
         +0x0dc LastSysTime      : Uint4B
         +0x0e0 WmiDispatchPtr   : Uint8B
         +0x0e8 WmiInterfaceEnabled : Int4B
         +0x0f0 FFHThrottleStateInfo : _PPM_FFH_THROTTLE_STATE_INFO
         +0x110 PerfActionDpc    : _KDPC
         +0x150 PerfActionMask   : Int4B
         +0x158 HvIdleCheck      : _PROC_IDLE_SNAP
         +0x168 CheckContext     : _PROC_PERF_CHECK_CONTEXT
         +0x1a8 Concurrency      : Ptr64 _PPM_CONCURRENCY_ACCOUNTING
         +0x1b0 ClassConcurrency : Ptr64 _PPM_CONCURRENCY_ACCOUNTING
         +0x1b8 ArchitecturalEfficiencyClass : UChar
         +0x1b9 PerformanceSchedulingClass : UChar
         +0x1ba EfficiencySchedulingClass : UChar
         +0x1bb Unused           : UChar
         +0x1bc Parked           : UChar
         +0x1bd LongPriorQosPeriod : UChar
         +0x1c0 SnapTimeLast     : Uint8B
         +0x1c0 EnergyConsumed   : Uint8B
         +0x1c8 ActiveTime       : Uint8B
         +0x1d0 TotalTime        : Uint8B
         +0x1d8 FxDevice         : Ptr64 _POP_FX_DEVICE
         +0x1e0 LastQosTranstionTsc : Uint8B
         +0x1e8 QosTransitionHysteresis : Uint8B
         +0x1f0 RequestedQosClass : _KHETERO_CPU_QOS
         +0x1f4 ResolvedQosClass : _KHETERO_CPU_QOS
         +0x1f8 QosEquivalencyMask : Uint2B
         +0x1fa HwFeedbackTableIndex : Uint2B
         +0x1fc HwFeedbackParkHint : UChar
         +0x1fd HwFeedbackPerformanceClass : UChar
         +0x1fe HwFeedbackEfficiencyClass : UChar
         +0x1ff HeteroCoreType   : UChar
      +0x8200 HyperPte         : Ptr64 Void
      +0x8208 ScbList          : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x8218 ForceIdleDpc     : _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x8258 DpcWatchdogDpc   : _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x8298 DpcWatchdogTimer : _KTIMER
         +0x000 Header           : _DISPATCHER_HEADER
         +0x018 DueTime          : _ULARGE_INTEGER
         +0x020 TimerListEntry   : _LIST_ENTRY
         +0x030 Dpc              : Ptr64 _KDPC
         +0x038 Processor        : Uint2B
         +0x03a TimerType        : Uint2B
         +0x03c Period           : Uint4B
      +0x82d8 Cache            : [5] _CACHE_DESCRIPTOR
         +0x000 Level            : UChar
         +0x001 Associativity    : UChar
         +0x002 LineSize         : Uint2B
         +0x004 Size             : Uint4B
         +0x008 Type             : _PROCESSOR_CACHE_TYPE
      +0x8314 CacheCount       : Uint4B
      +0x8318 CachedCommit     : Uint4B
      +0x831c CachedResidentAvailable : Uint4B
      +0x8320 WheaInfo         : Ptr64 Void
      +0x8328 EtwSupport       : Ptr64 Void
      +0x8330 ExSaPageArray    : Ptr64 Void
      +0x8338 KeAlignmentFixupCount : Uint4B
      +0x833c PrcbPad95        : Uint4B
      +0x8340 HypercallPageList : _SLIST_HEADER
         +0x000 Alignment        : Uint8B
         +0x008 Region           : Uint8B
         +0x000 HeaderX64        : <anonymous-tag>
      +0x8350 StatisticsPage   : Ptr64 Uint8B
      +0x8358 GenerationTarget : Uint8B
      +0x8360 PrcbPad85        : [4] Uint8B
      +0x8380 HypercallCachedPages : Ptr64 Void
      +0x8388 VirtualApicAssist : Ptr64 Void
      +0x8390 PackageProcessorSet : _KAFFINITY_EX
         +0x000 Count            : Uint2B
         +0x002 Size             : Uint2B
         +0x004 Reserved         : Uint4B
         +0x008 Bitmap           : [20] Uint8B
      +0x8438 PackageId        : Uint4B
      +0x843c PrcbPad86        : Uint4B
      +0x8440 SharedReadyQueueMask : Uint8B
      +0x8448 SharedReadyQueue : Ptr64 _KSHARED_READY_QUEUE
         +0x000 Lock             : Uint8B
         +0x008 ReadySummary     : Uint4B
         +0x010 ReadyListHead    : [32] _LIST_ENTRY
         +0x210 RunningSummary   : [64] Char
         +0x250 Span             : UChar
         +0x251 LowProcIndex     : UChar
         +0x252 QueueIndex       : UChar
         +0x253 ProcCount        : UChar
         +0x254 ScanOwner        : UChar
         +0x255 Spare            : [3] UChar
         +0x258 Affinity         : Uint8B
         +0x260 ReadyThreadCount : Uint4B
         +0x268 ReadyQueueExpectedRunTime : Uint8B
      +0x8450 SharedQueueScanOwner : Uint4B
      +0x8454 ScanSiblingIndex : Uint4B
      +0x8458 CoreProcessorSet : Uint8B
      +0x8460 ScanSiblingMask  : Uint8B
      +0x8468 LLCMask          : Uint8B
      +0x8470 CacheProcessorMask : [5] Uint8B
      +0x8498 ProcessorProfileControlArea : Ptr64 _PROCESSOR_PROFILE_CONTROL_AREA
         +0x000 PebsDsSaveArea   : _PEBS_DS_SAVE_AREA
      +0x84a0 ProfileEventIndexAddress : Ptr64 Void
      +0x84a8 DpcWatchdogProfile : Ptr64 Ptr64 Void
      +0x84b0 DpcWatchdogProfileCurrentEmptyCapture : Ptr64 Ptr64 Void
      +0x84b8 SchedulerAssist  : Ptr64 Void
      +0x84c0 SynchCounters    : _SYNCH_COUNTERS
         +0x000 SpinLockAcquireCount : Uint4B
         +0x004 SpinLockContentionCount : Uint4B
         +0x008 SpinLockSpinCount : Uint4B
         +0x00c IpiSendRequestBroadcastCount : Uint4B
         +0x010 IpiSendRequestRoutineCount : Uint4B
         +0x014 IpiSendSoftwareInterruptCount : Uint4B
         +0x018 ExInitializeResourceCount : Uint4B
         +0x01c ExReInitializeResourceCount : Uint4B
         +0x020 ExDeleteResourceCount : Uint4B
         +0x024 ExecutiveResourceAcquiresCount : Uint4B
         +0x028 ExecutiveResourceContentionsCount : Uint4B
         +0x02c ExecutiveResourceReleaseExclusiveCount : Uint4B
         +0x030 ExecutiveResourceReleaseSharedCount : Uint4B
         +0x034 ExecutiveResourceConvertsCount : Uint4B
         +0x038 ExAcqResExclusiveAttempts : Uint4B
         +0x03c ExAcqResExclusiveAcquiresExclusive : Uint4B
         +0x040 ExAcqResExclusiveAcquiresExclusiveRecursive : Uint4B
         +0x044 ExAcqResExclusiveWaits : Uint4B
         +0x048 ExAcqResExclusiveNotAcquires : Uint4B
         +0x04c ExAcqResSharedAttempts : Uint4B
         +0x050 ExAcqResSharedAcquiresExclusive : Uint4B
         +0x054 ExAcqResSharedAcquiresShared : Uint4B
         +0x058 ExAcqResSharedAcquiresSharedRecursive : Uint4B
         +0x05c ExAcqResSharedWaits : Uint4B
         +0x060 ExAcqResSharedNotAcquires : Uint4B
         +0x064 ExAcqResSharedStarveExclusiveAttempts : Uint4B
         +0x068 ExAcqResSharedStarveExclusiveAcquiresExclusive : Uint4B
         +0x06c ExAcqResSharedStarveExclusiveAcquiresShared : Uint4B
         +0x070 ExAcqResSharedStarveExclusiveAcquiresSharedRecursive : Uint4B
         +0x074 ExAcqResSharedStarveExclusiveWaits : Uint4B
         +0x078 ExAcqResSharedStarveExclusiveNotAcquires : Uint4B
         +0x07c ExAcqResSharedWaitForExclusiveAttempts : Uint4B
         +0x080 ExAcqResSharedWaitForExclusiveAcquiresExclusive : Uint4B
         +0x084 ExAcqResSharedWaitForExclusiveAcquiresShared : Uint4B
         +0x088 ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive : Uint4B
         +0x08c ExAcqResSharedWaitForExclusiveWaits : Uint4B
         +0x090 ExAcqResSharedWaitForExclusiveNotAcquires : Uint4B
         +0x094 ExSetResOwnerPointerExclusive : Uint4B
         +0x098 ExSetResOwnerPointerSharedNew : Uint4B
         +0x09c ExSetResOwnerPointerSharedOld : Uint4B
         +0x0a0 ExTryToAcqExclusiveAttempts : Uint4B
         +0x0a4 ExTryToAcqExclusiveAcquires : Uint4B
         +0x0a8 ExBoostExclusiveOwner : Uint4B
         +0x0ac ExBoostSharedOwners : Uint4B
         +0x0b0 ExEtwSynchTrackingNotificationsCount : Uint4B
         +0x0b4 ExEtwSynchTrackingNotificationsAccountedCount : Uint4B
      +0x8578 PrcbPad94        : Uint8B
      +0x8580 FsCounters       : _FILESYSTEM_DISK_COUNTERS
         +0x000 FsBytesRead      : Uint8B
         +0x008 FsBytesWritten   : Uint8B
      +0x8590 VendorString     : [13] UChar
      +0x859d PrcbPad100       : [3] UChar
      +0x85a0 FeatureBits      : Uint8B
      +0x85a8 UpdateSignature  : _LARGE_INTEGER
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
         +0x000 u                : <anonymous-tag>
         +0x000 QuadPart         : Int8B
      +0x85b0 PteBitCache      : Uint8B
      +0x85b8 PteBitOffset     : Uint4B
      +0x85bc PrcbPad105       : Uint4B
      +0x85c0 Context          : Ptr64 _CONTEXT
         +0x000 P1Home           : Uint8B
         +0x008 P2Home           : Uint8B
         +0x010 P3Home           : Uint8B
         +0x018 P4Home           : Uint8B
         +0x020 P5Home           : Uint8B
         +0x028 P6Home           : Uint8B
         +0x030 ContextFlags     : Uint4B
         +0x034 MxCsr            : Uint4B
         +0x038 SegCs            : Uint2B
         +0x03a SegDs            : Uint2B
         +0x03c SegEs            : Uint2B
         +0x03e SegFs            : Uint2B
         +0x040 SegGs            : Uint2B
         +0x042 SegSs            : Uint2B
         +0x044 EFlags           : Uint4B
         +0x048 Dr0              : Uint8B
         +0x050 Dr1              : Uint8B
         +0x058 Dr2              : Uint8B
         +0x060 Dr3              : Uint8B
         +0x068 Dr6              : Uint8B
         +0x070 Dr7              : Uint8B
         +0x078 Rax              : Uint8B
         +0x080 Rcx              : Uint8B
         +0x088 Rdx              : Uint8B
         +0x090 Rbx              : Uint8B
         +0x098 Rsp              : Uint8B
         +0x0a0 Rbp              : Uint8B
         +0x0a8 Rsi              : Uint8B
         +0x0b0 Rdi              : Uint8B
         +0x0b8 R8               : Uint8B
         +0x0c0 R9               : Uint8B
         +0x0c8 R10              : Uint8B
         +0x0d0 R11              : Uint8B
         +0x0d8 R12              : Uint8B
         +0x0e0 R13              : Uint8B
         +0x0e8 R14              : Uint8B
         +0x0f0 R15              : Uint8B
         +0x0f8 Rip              : Uint8B
         +0x100 FltSave          : _XSAVE_FORMAT
         +0x100 Header           : [2] _M128A
         +0x120 Legacy           : [8] _M128A
         +0x1a0 Xmm0             : _M128A
         +0x1b0 Xmm1             : _M128A
         +0x1c0 Xmm2             : _M128A
         +0x1d0 Xmm3             : _M128A
         +0x1e0 Xmm4             : _M128A
         +0x1f0 Xmm5             : _M128A
         +0x200 Xmm6             : _M128A
         +0x210 Xmm7             : _M128A
         +0x220 Xmm8             : _M128A
         +0x230 Xmm9             : _M128A
         +0x240 Xmm10            : _M128A
         +0x250 Xmm11            : _M128A
         +0x260 Xmm12            : _M128A
         +0x270 Xmm13            : _M128A
         +0x280 Xmm14            : _M128A
         +0x290 Xmm15            : _M128A
         +0x300 VectorRegister   : [26] _M128A
         +0x4a0 VectorControl    : Uint8B
         +0x4a8 DebugControl     : Uint8B
         +0x4b0 LastBranchToRip  : Uint8B
         +0x4b8 LastBranchFromRip : Uint8B
         +0x4c0 LastExceptionToRip : Uint8B
         +0x4c8 LastExceptionFromRip : Uint8B
      +0x85c8 ContextFlagsInit : Uint4B
      +0x85cc PrcbPad115       : Uint4B
      +0x85d0 ExtendedState    : Ptr64 _XSAVE_AREA
         +0x000 LegacyState      : _XSAVE_FORMAT
         +0x200 Header           : _XSAVE_AREA_HEADER
      +0x85d8 IsrStack         : Ptr64 Void
      +0x85e0 EntropyTimingState : _KENTROPY_TIMING_STATE
         +0x000 EntropyCount     : Uint4B
         +0x004 Buffer           : [64] Uint4B
         +0x108 Dpc              : _KDPC
         +0x148 LastDeliveredBuffer : Uint4B
      +0x8730 PrcbPad110       : Uint8B
      +0x8738 StibpPairingTrace : <anonymous-tag>
         +0x000 UpdateCycle      : Uint4B
         +0x004 PairLocal        : Int2B
         +0x004 PairLocalLow     : UChar
         +0x005 PairLocalForceStibp : Pos 0, 1 Bit
         +0x005 Reserved         : Pos 1, 4 Bits
         +0x005 Frozen           : Pos 5, 1 Bit
         +0x005 ForceUntrusted   : Pos 6, 1 Bit
         +0x005 SynchIpi         : Pos 7, 1 Bit
         +0x006 PairRemote       : Int2B
         +0x006 PairRemoteLow    : UChar
         +0x007 Reserved2        : UChar
         +0x008 Trace            : [24] UChar
         +0x020 LocalDomain      : Uint8B
         +0x028 RemoteDomain     : Uint8B
         +0x030 Thread           : Ptr64 _KTHREAD
      +0x8770 AbSelfIoBoostsList : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
      +0x8778 AbPropagateBoostsList : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
      +0x8780 AbDpc            : _KDPC
         +0x000 TargetInfoAsUlong : Uint4B
         +0x000 Type             : UChar
         +0x001 Importance       : UChar
         +0x002 Number           : Uint2B
         +0x008 DpcListEntry     : _SINGLE_LIST_ENTRY
         +0x010 ProcessorHistory : Uint8B
         +0x018 DeferredRoutine  : Ptr64           void 
         +0x020 DeferredContext  : Ptr64 Void
         +0x028 SystemArgument1  : Ptr64 Void
         +0x030 SystemArgument2  : Ptr64 Void
         +0x038 DpcData          : Ptr64 Void
      +0x87c0 IoIrpStackProfilerCurrent : _IOP_IRP_STACK_PROFILER
         +0x000 Profile          : [20] Uint4B
         +0x050 TotalIrps        : Uint4B
      +0x8814 IoIrpStackProfilerPrevious : _IOP_IRP_STACK_PROFILER
         +0x000 Profile          : [20] Uint4B
         +0x050 TotalIrps        : Uint4B
      +0x8868 SecureFault      : _KSECURE_FAULT_INFORMATION
         +0x000 FaultCode        : Uint8B
         +0x008 FaultVa          : Uint8B
      +0x8878 PrcbPad120       : Uint8B
      +0x8880 LocalSharedReadyQueue : _KSHARED_READY_QUEUE
         +0x000 Lock             : Uint8B
         +0x008 ReadySummary     : Uint4B
         +0x010 ReadyListHead    : [32] _LIST_ENTRY
         +0x210 RunningSummary   : [64] Char
         +0x250 Span             : UChar
         +0x251 LowProcIndex     : UChar
         +0x252 QueueIndex       : UChar
         +0x253 ProcCount        : UChar
         +0x254 ScanOwner        : UChar
         +0x255 Spare            : [3] UChar
         +0x258 Affinity         : Uint8B
         +0x260 ReadyThreadCount : Uint4B
         +0x268 ReadyQueueExpectedRunTime : Uint8B
      +0x8af0 PrcbPad125       : [2] Uint8B
      +0x8b00 TimerExpirationTraceCount : Uint4B
      +0x8b04 PrcbPad127       : Uint4B
      +0x8b08 TimerExpirationTrace : [16] _KTIMER_EXPIRATION_TRACE
         +0x000 InterruptTime    : Uint8B
         +0x008 PerformanceCounter : _LARGE_INTEGER
      +0x8c08 PrcbPad128       : [7] Uint8B
      +0x8c40 Mailbox          : Ptr64 _REQUEST_MAILBOX
         +0x000 Next             : Ptr64 _REQUEST_MAILBOX
         +0x008 RequestSummary   : Uint8B
         +0x010 RequestPacket    : _KREQUEST_PACKET
         +0x030 NodeTargetCountAddr : Ptr64 Int4B
         +0x038 NodeTargetCount  : Int4B
      +0x8c48 PrcbPad130       : [7] Uint8B
      +0x8c80 McheckContext    : [2] _MACHINE_CHECK_CONTEXT
         +0x000 MachineFrame     : _MACHINE_FRAME
         +0x028 Rax              : Uint8B
         +0x030 Rcx              : Uint8B
         +0x038 Rdx              : Uint8B
         +0x040 GsBase           : Uint8B
         +0x048 Cr3              : Uint8B
      +0x8d20 PrcbPad134       : [4] Uint8B
      +0x8d40 SelfmapLockHandle : [4] _KLOCK_QUEUE_HANDLE
         +0x000 LockQueue        : _KSPIN_LOCK_QUEUE
         +0x010 OldIrql          : UChar
      +0x8da0 PrcbPad134a      : [4] Uint8B
      +0x8dc0 PrcbPad138       : [128] UChar
      +0x8e40 PrcbPad138a      : [64] UChar
      +0x8e80 KernelDirectoryTableBase : Uint8B
      +0x8e88 RspBaseShadow    : Uint8B
      +0x8e90 UserRspShadow    : Uint8B
      +0x8e98 ShadowFlags      : Uint4B
      +0x8e9c PrcbPad138b      : Uint4B
      +0x8ea0 PrcbPad138c      : Uint8B
      +0x8ea8 PrcbPad138d      : Uint2B
      +0x8eaa VerwSelector     : Uint2B
      +0x8eac DbgMceNestingLevel : Uint4B
      +0x8eb0 DbgMceFlags      : Uint4B
      +0x8eb4 PrcbPad139b      : Uint4B
      +0x8eb8 PrcbPad140       : [505] Uint8B
      +0x9e80 PrcbPad140a      : [8] Uint8B
      +0x9ec0 PrcbPad141       : [504] Uint8B
      +0xae80 PrcbPad141a      : [64] UChar
      +0xaec0 RequestMailbox   : [1] _REQUEST_MAILBOX
         +0x000 Next             : Ptr64 _REQUEST_MAILBOX
         +0x008 RequestSummary   : Uint8B
         +0x010 RequestPacket    : _KREQUEST_PACKET
         +0x030 NodeTargetCountAddr : Ptr64 Int4B
         +0x038 NodeTargetCount  : Int4B
   +0x288 SchedulerApcFill4 : [72] UChar
   +0x2d0 LegoData         : Ptr64 Void
   +0x288 SchedulerApcFill5 : [83] UChar
   +0x2db CallbackNestingLevel : UChar
   +0x2dc UserTime         : Uint4B
   +0x2e0 SuspendEvent     : _KEVENT
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Lock             : Int4B
         +0x000 LockNV           : Int4B
         +0x000 Type             : UChar
         +0x001 Signalling       : UChar
         +0x002 Size             : UChar
         +0x003 Reserved1        : UChar
         +0x000 TimerType        : UChar
         +0x001 TimerControlFlags : UChar
         +0x001 Absolute         : Pos 0, 1 Bit
         +0x001 Wake             : Pos 1, 1 Bit
         +0x001 EncodedTolerableDelay : Pos 2, 6 Bits
         +0x002 Hand             : UChar
         +0x003 TimerMiscFlags   : UChar
         +0x003 Index            : Pos 0, 6 Bits
         +0x003 Inserted         : Pos 6, 1 Bit
         +0x003 Expired          : Pos 7, 1 Bit
         +0x000 Timer2Type       : UChar
         +0x001 Timer2Flags      : UChar
         +0x001 Timer2Inserted   : Pos 0, 1 Bit
         +0x001 Timer2Expiring   : Pos 1, 1 Bit
         +0x001 Timer2CancelPending : Pos 2, 1 Bit
         +0x001 Timer2SetPending : Pos 3, 1 Bit
         +0x001 Timer2Running    : Pos 4, 1 Bit
         +0x001 Timer2Disabled   : Pos 5, 1 Bit
         +0x001 Timer2ReservedFlags : Pos 6, 2 Bits
         +0x002 Timer2ComponentId : UChar
         +0x003 Timer2RelativeId : UChar
         +0x000 QueueType        : UChar
         +0x001 QueueControlFlags : UChar
         +0x001 Abandoned        : Pos 0, 1 Bit
         +0x001 DisableIncrement : Pos 1, 1 Bit
         +0x001 QueueReservedControlFlags : Pos 2, 6 Bits
         +0x002 QueueSize        : UChar
         +0x003 QueueReserved    : UChar
         +0x000 ThreadType       : UChar
         +0x001 ThreadReserved   : UChar
         +0x002 ThreadControlFlags : UChar
         +0x002 CycleProfiling   : Pos 0, 1 Bit
         +0x002 CounterProfiling : Pos 1, 1 Bit
         +0x002 GroupScheduling  : Pos 2, 1 Bit
         +0x002 AffinitySet      : Pos 3, 1 Bit
         +0x002 Tagged           : Pos 4, 1 Bit
         +0x002 EnergyProfiling  : Pos 5, 1 Bit
         +0x002 SchedulerAssist  : Pos 6, 1 Bit
         +0x002 ThreadReservedControlFlags : Pos 7, 1 Bit
         +0x003 DebugActive      : UChar
         +0x003 ActiveDR7        : Pos 0, 1 Bit
         +0x003 Instrumented     : Pos 1, 1 Bit
         +0x003 Minimal          : Pos 2, 1 Bit
         +0x003 Reserved4        : Pos 3, 2 Bits
         +0x003 AltSyscall       : Pos 5, 1 Bit
         +0x003 UmsScheduled     : Pos 6, 1 Bit
         +0x003 UmsPrimary       : Pos 7, 1 Bit
         +0x000 MutantType       : UChar
         +0x001 MutantSize       : UChar
         +0x002 DpcActive        : UChar
         +0x003 MutantReserved   : UChar
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
   +0x2f8 ThreadListEntry  : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x308 MutantListHead   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x318 AbEntrySummary   : UChar
   +0x319 AbWaitEntryCount : UChar
   +0x31a AbAllocationRegionCount : UChar
   +0x31b SystemPriority   : Char
   +0x31c SecureThreadCookie : Uint4B
   +0x320 LockEntries      : Ptr64 _KLOCK_ENTRY
      +0x000 TreeNode         : _RTL_BALANCED_NODE
         +0x000 Children         : [2] Ptr64 _RTL_BALANCED_NODE
         +0x000 Left             : Ptr64 _RTL_BALANCED_NODE
         +0x008 Right            : Ptr64 _RTL_BALANCED_NODE
         +0x010 Red              : Pos 0, 1 Bit
         +0x010 Balance          : Pos 0, 2 Bits
         +0x010 ParentValue      : Uint8B
      +0x000 FreeListEntry    : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
      +0x018 EntryFlags       : Uint4B
      +0x018 EntryOffset      : UChar
      +0x019 ThreadLocalFlags : UChar
      +0x019 WaitingBit       : Pos 0, 1 Bit
      +0x019 Spare0           : Pos 1, 7 Bits
      +0x01a AcquiredByte     : UChar
      +0x01a AcquiredBit      : Pos 0, 1 Bit
      +0x01b CrossThreadFlags : UChar
      +0x01b HeadNodeBit      : Pos 0, 1 Bit
      +0x01b IoPriorityBit    : Pos 1, 1 Bit
      +0x01b IoQoSWaiter      : Pos 2, 1 Bit
      +0x01b Spare1           : Pos 3, 5 Bits
      +0x018 StaticState      : Pos 0, 8 Bits
      +0x018 AllFlags         : Pos 8, 24 Bits
      +0x01c SpareFlags       : Uint4B
      +0x020 LockState        : _KLOCK_ENTRY_LOCK_STATE
         +0x000 CrossThreadReleasable : Pos 0, 1 Bit
         +0x000 Busy             : Pos 1, 1 Bit
         +0x000 Reserved         : Pos 2, 61 Bits
         +0x000 InTree           : Pos 63, 1 Bit
         +0x000 LockState        : Ptr64 Void
         +0x008 SessionState     : Ptr64 Void
         +0x008 SessionId        : Uint4B
         +0x00c SessionPad       : Uint4B
      +0x020 LockUnsafe       : Ptr64 Void
      +0x020 CrossThreadReleasableAndBusyByte : UChar
      +0x021 Reserved         : [6] UChar
      +0x027 InTreeByte       : UChar
      +0x028 SessionState     : Ptr64 Void
      +0x028 SessionId        : Uint4B
      +0x02c SessionPad       : Uint4B
      +0x030 OwnerTree        : _RTL_RB_TREE
         +0x000 Root             : Ptr64 _RTL_BALANCED_NODE
         +0x008 Encoded          : Pos 0, 1 Bit
         +0x008 Min              : Ptr64 _RTL_BALANCED_NODE
      +0x040 WaiterTree       : _RTL_RB_TREE
         +0x000 Root             : Ptr64 _RTL_BALANCED_NODE
         +0x008 Encoded          : Pos 0, 1 Bit
         +0x008 Min              : Ptr64 _RTL_BALANCED_NODE
      +0x030 CpuPriorityKey   : Char
      +0x050 EntryLock        : Uint8B
      +0x058 BoostBitmap      : _KLOCK_ENTRY_BOOST_BITMAP
         +0x000 AllFields        : Uint4B
         +0x000 AllBoosts        : Pos 0, 17 Bits
         +0x000 Reserved         : Pos 17, 15 Bits
         +0x000 CpuBoostsBitmap  : Pos 0, 15 Bits
         +0x000 IoBoost          : Pos 15, 1 Bit
         +0x002 IoQoSBoost       : Pos 0, 1 Bit
         +0x002 IoNormalPriorityWaiterCount : Pos 1, 8 Bits
         +0x002 IoQoSWaiterCount : Pos 9, 7 Bits
      +0x05c SparePad         : Uint4B
   +0x328 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
   +0x330 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
   +0x338 PriorityFloorCounts : [16] UChar
   +0x348 PriorityFloorCountsReserved : [16] UChar
   +0x358 PriorityFloorSummary : Uint4B
   +0x35c AbCompletedIoBoostCount : Int4B
   +0x360 AbCompletedIoQoSBoostCount : Int4B
   +0x364 KeReferenceCount : Int2B
   +0x366 AbOrphanedEntrySummary : UChar
   +0x367 AbOwnedEntryCount : UChar
   +0x368 ForegroundLossTime : Uint4B
   +0x370 GlobalForegroundListEntry : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x370 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
   +0x378 InGlobalForegroundList : Uint8B
   +0x380 ReadOperationCount : Int8B
   +0x388 WriteOperationCount : Int8B
   +0x390 OtherOperationCount : Int8B
   +0x398 ReadTransferCount : Int8B
   +0x3a0 WriteTransferCount : Int8B
   +0x3a8 OtherTransferCount : Int8B
   +0x3b0 QueuedScb        : Ptr64 _KSCB
      +0x000 GenerationCycles : Uint8B
      +0x008 MinQuotaCycleTarget : Uint8B
      +0x010 MaxQuotaCycleTarget : Uint8B
      +0x018 RankCycleTarget  : Uint8B
      +0x020 LongTermCycles   : Uint8B
      +0x028 LastReportedCycles : Uint8B
      +0x030 OverQuotaHistory : Uint8B
      +0x038 ReadyTime        : Uint8B
      +0x040 InsertTime       : Uint8B
      +0x048 PerProcessorList : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x058 QueueNode        : _RTL_BALANCED_NODE
         +0x000 Children         : [2] Ptr64 _RTL_BALANCED_NODE
         +0x000 Left             : Ptr64 _RTL_BALANCED_NODE
         +0x008 Right            : Ptr64 _RTL_BALANCED_NODE
         +0x010 Red              : Pos 0, 1 Bit
         +0x010 Balance          : Pos 0, 2 Bits
         +0x010 ParentValue      : Uint8B
      +0x070 Inserted         : Pos 0, 1 Bit
      +0x070 MaxOverQuota     : Pos 1, 1 Bit
      +0x070 MinOverQuota     : Pos 2, 1 Bit
      +0x070 RankBias         : Pos 3, 1 Bit
      +0x070 SoftCap          : Pos 4, 1 Bit
      +0x070 ShareRankOwner   : Pos 5, 1 Bit
      +0x070 Spare1           : Pos 6, 2 Bits
      +0x071 Depth            : UChar
      +0x072 ReadySummary     : Uint2B
      +0x074 Rank             : Uint4B
      +0x078 ShareRank        : Ptr64 Uint4B
      +0x080 OwnerShareRank   : Uint4B
      +0x088 ReadyListHead    : [16] _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x188 ChildScbQueue    : _RTL_RB_TREE
         +0x000 Root             : Ptr64 _RTL_BALANCED_NODE
         +0x008 Encoded          : Pos 0, 1 Bit
         +0x008 Min              : Ptr64 _RTL_BALANCED_NODE
      +0x198 Parent           : Ptr64 _KSCB
         +0x000 GenerationCycles : Uint8B
         +0x008 MinQuotaCycleTarget : Uint8B
         +0x010 MaxQuotaCycleTarget : Uint8B
         +0x018 RankCycleTarget  : Uint8B
         +0x020 LongTermCycles   : Uint8B
         +0x028 LastReportedCycles : Uint8B
         +0x030 OverQuotaHistory : Uint8B
         +0x038 ReadyTime        : Uint8B
         +0x040 InsertTime       : Uint8B
         +0x048 PerProcessorList : _LIST_ENTRY
         +0x058 QueueNode        : _RTL_BALANCED_NODE
         +0x070 Inserted         : Pos 0, 1 Bit
         +0x070 MaxOverQuota     : Pos 1, 1 Bit
         +0x070 MinOverQuota     : Pos 2, 1 Bit
         +0x070 RankBias         : Pos 3, 1 Bit
         +0x070 SoftCap          : Pos 4, 1 Bit
         +0x070 ShareRankOwner   : Pos 5, 1 Bit
         +0x070 Spare1           : Pos 6, 2 Bits
         +0x071 Depth            : UChar
         +0x072 ReadySummary     : Uint2B
         +0x074 Rank             : Uint4B
         +0x078 ShareRank        : Ptr64 Uint4B
         +0x080 OwnerShareRank   : Uint4B
         +0x088 ReadyListHead    : [16] _LIST_ENTRY
         +0x188 ChildScbQueue    : _RTL_RB_TREE
         +0x198 Parent           : Ptr64 _KSCB
         +0x1a0 Root             : Ptr64 _KSCB
      +0x1a0 Root             : Ptr64 _KSCB
         +0x000 GenerationCycles : Uint8B
         +0x008 MinQuotaCycleTarget : Uint8B
         +0x010 MaxQuotaCycleTarget : Uint8B
         +0x018 RankCycleTarget  : Uint8B
         +0x020 LongTermCycles   : Uint8B
         +0x028 LastReportedCycles : Uint8B
         +0x030 OverQuotaHistory : Uint8B
         +0x038 ReadyTime        : Uint8B
         +0x040 InsertTime       : Uint8B
         +0x048 PerProcessorList : _LIST_ENTRY
         +0x058 QueueNode        : _RTL_BALANCED_NODE
         +0x070 Inserted         : Pos 0, 1 Bit
         +0x070 MaxOverQuota     : Pos 1, 1 Bit
         +0x070 MinOverQuota     : Pos 2, 1 Bit
         +0x070 RankBias         : Pos 3, 1 Bit
         +0x070 SoftCap          : Pos 4, 1 Bit
         +0x070 ShareRankOwner   : Pos 5, 1 Bit
         +0x070 Spare1           : Pos 6, 2 Bits
         +0x071 Depth            : UChar
         +0x072 ReadySummary     : Uint2B
         +0x074 Rank             : Uint4B
         +0x078 ShareRank        : Ptr64 Uint4B
         +0x080 OwnerShareRank   : Uint4B
         +0x088 ReadyListHead    : [16] _LIST_ENTRY
         +0x188 ChildScbQueue    : _RTL_RB_TREE
         +0x198 Parent           : Ptr64 _KSCB
         +0x1a0 Root             : Ptr64 _KSCB
   +0x3b8 ThreadTimerDelay : Uint4B
   +0x3bc ThreadFlags3     : Int4B
   +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits
   +0x3bc PpmPolicy        : Pos 8, 2 Bits
   +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits
   +0x3c0 TracingPrivate   : [1] Uint8B
   +0x3c8 SchedulerAssist  : Ptr64 Void
   +0x3d0 AbWaitObject     : Ptr64 Void
   +0x3d8 ReservedPreviousReadyTimeValue : Uint4B
   +0x3e0 KernelWaitTime   : Uint8B
   +0x3e8 UserWaitTime     : Uint8B
   +0x3f0 GlobalUpdateVpThreadPriorityListEntry : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : _SINGLE_LIST_ENTRY
      +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr64 _SINGLE_LIST_ENTRY
   +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B
   +0x400 SchedulerAssistPriorityFloor : Int4B
   +0x404 Spare28          : Uint4B
   +0x408 ResourceIndex    : UChar
   +0x409 Spare31          : [3] UChar
   +0x410 EndPadding       : [4] Uint8B